[{"id":1,"title":"hi","text":"us","coffeeHouseId":2,"filtered":true,"coffeehouse":{"id":2,"name":"Ammar's Coffee"},"Keyword":[]},{"id":3,"title":"lets test alerts","text":"woww this should work","coffeeHouseId":2,"filtered":false,"coffeehouse":{"id":2,"name":"Ammar's Coffee"},"Keyword":[]},{"id":4,"title":"our alert has a timer","text":"oooo ","coffeeHouseId":2,"filtered":false,"coffeehouse":{"id":2,"name":"Ammar's Coffee"},"Keyword":[]},{"id":5,"title":"What an amazing coffeehouse experience I had","text":"this was just out of this world. ","coffeeHouseId":2,"filtered":false,"coffeehouse":{"id":2,"name":"Ammar's Coffee"},"Keyword":[]},{"id":6,"title":"hi","text":"this is cool","coffeeHouseId":2,"filtered":false,"coffeehouse":{"id":2,"name":"Ammar's Coffee"},"Keyword":[]},{"id":7,"title":"Nice mild coffee","text":"Very nice coffee. Low prices. Very few tables though to sit . Option to buy coffee beans and cut for any type of coffee machine","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[{"phrase":"Very few tables though to sit","id":4},{"phrase":"Option to buy coffee beans","id":5}]},{"id":8,"title":"Pretty coffee shop","text":"Excellent coffee, friendly staff! Many types of coffee beans so perfect for coffee lovers, Try the cappuccino!","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[{"phrase":"friendly staff","id":6},{"phrase":"Many types of coffee","id":7}]},{"id":9,"title":"TOMOCA COFFEE","text":"Excellent coffee and service. We were a big group of travelers and they served everybody with a beautiful smile","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"served everybody with a beautiful smile","id":8}]},{"id":10,"title":"Best coffee experience ever","text":"Amazing and local coffee shop with Ethiopian beans coffee\n\nThe experience is wonderful, they serve fresh roasted coffee bean with the Ethiopian tradition\n\nThe prices are extremely cheap compared to Europe \n\nThe coffee taste is authentic and I feel that is more strong than other countries \n\nI will definitely come back","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"fresh roasted coffee bean with the Ethiopian tradition","id":9},{"phrase":"more strong than other countries","id":10}]},{"id":11,"title":"The best and strong coffee","text":"Oh I just love the coffee and thanks to Tomoca every morning I fill up my self with Tomoca coffee and the coffee is the most strong and delicious","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"coffee is the most strong and delicious","id":11},{"phrase":"every morning I fill up my self with Tomoca coffee","id":12}]},{"id":12,"title":"Tomoca mon amour","text":"Tiny coffee place near Piazza. Great atmosphere to observe locals mingling and to taste excellent coffee. Highly recommended","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Tiny coffee place near Piazza","id":13},{"phrase":"Great atmosphere","id":14},{"phrase":"observe locals mingling","id":15}]},{"id":13,"title":"Good tasting coffe","text":"I love the coffe here it tastes so good and the ambience is so friendly, one thing is that there is not much room in the place and since it’s famous a lot of people go, we didn’t have enough time because we had to catch our plane but overall I bought some coffee to take back home","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"ambience is so friendly","id":16},{"phrase":"there is not much room","id":17}]},{"id":14,"title":"THE coffee place to visit in Addis","text":"This place hasn’t changed much compared to when it was opened in 1953. Busy, busy, busy, but a must visit in Addis","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Busy, busy, busy","id":18},{"phrase":"hasn’t changed much compared to when it was opened in 1953","id":19}]},{"id":15,"title":"Coffee Latte","text":"One of the best caffe in the town with different types of coffee serving.In Tomoca had self service system. I had coffee latte with my friend and they prepared very nicely.","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"different types of coffee serving","id":20},{"phrase":"self service system","id":21},{"phrase":"prepared very nicely","id":22}]},{"id":16,"title":"Great coffee","text":"Quick stop near my hotel in Addis. Heard from a colleague it’s one of the most famous franchises in Addis. Didn’t disappoint - lovely smooth coffee with a fruity undertone! Only issue was the lack of seating but that might be because of the pandemic.","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Quick stop near my hotel","id":23},{"phrase":"lovely smooth coffee with a fruity undertone","id":24},{"phrase":"lack of seating","id":25}]},{"id":17,"title":"Well roasted","text":"Well roasted and beautifully poured at your exact bitterness of coffee taste you prefer! A true Habesha coffee taste! TOMOCA is Splendid 👌🏽","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Well roasted and beautifully poured","id":26},{"phrase":"exact bitterness of coffee taste you prefer","id":27},{"phrase":"true Habesha coffee taste","id":28},{"phrase":"Splendid","id":29}]},{"id":18,"title":"Excellent coffee.","text":"Stand up only,with a very limited range of pastries and biscuits. Fast service and good prices for excellent coffee.","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Stand up only","id":30},{"phrase":"very limited range of pastries and biscuits","id":31}]},{"id":19,"title":"One of the best coffee in Ethiopia","text":"I love their coffee and even Ethiopians do. You can buy coffee beans or roasted coffee powder. Which is amazing and it has consistent taste. You can easily find this brand from anywhere in Ethiopia.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"You can buy coffee beans or roasted coffee powder","id":32},{"phrase":"consistent taste","id":33},{"phrase":"find this brand from anywhere in Ethiopia","id":34}]},{"id":20,"title":"Terrible","text":"One of the worst meals I have had in my entire life, the food also took about a half-hour to be made.\n","coffeeHouseId":5,"filtered":true,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[]},{"id":21,"title":"I Love Tomoca coffee","text":"When ever I travel to Ethiopia I make sure I get my roasted coffee from Tomoca , I believe they do not mix any other product, I truest them and always looking for ward to have it.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"get my roasted coffee from Tomoca","id":35},{"phrase":"they do not mix any other product","id":36}]},{"id":22,"title":"The best coffee shop in the","text":"The best coffee shop in the town! I have finally made it and had to take a few packages of coffee for friends and family! All in one I really recommend this coffee shop for everyone! And hopefully I will come back to Ethiopia again and will definitely get the coffee\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"had to take a few packages of coffee for friends and family","id":42}]},{"id":23,"title":"Super flavored coffee","text":"While you can’t go wrong with coffee in Addis , Tomoca is particulary flavored Coffee , rich and aromatic , strong with no bitterness . Once you enter you will he received with the best coffee aroma . We did not stay but grabbed coffee to go . Buying ground or coffee beans and making your own coffee at home Will not fail you .\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"particulary flavored Coffee","id":43},{"phrase":"rich and aromatic","id":44},{"phrase":"grabbed coffee to go","id":45},{"phrase":"strong with no bitterness","id":46}]},{"id":24,"title":"Great coffee","text":"If you like coffee, this is the place you have to go. They make the best coffee in the world. The old place has its charm and very special atmosphere. You will meet local people that are nice to talk to.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"best coffee in the world","id":47},{"phrase":"old place has its charm and very special atmosphere","id":48},{"phrase":"meet local people ","id":49}]},{"id":25,"title":"Best coffee","text":"Nice coffee. Great vibe. The coffee's taste consistancy is admirable and the service is nice too.👍☕\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Great vibe","id":50},{"phrase":"coffee's taste consistancy","id":51},{"phrase":"admirable","id":52},{"phrase":"service is nice too","id":53}]},{"id":26,"title":"Tomoca best cup of coffee","text":"I visited tomoca new branch in addis ababa meskel flower it modern and clean with smile of workers and fast to get nice machiato coffee or espresso with fair price. I advice all to visit and enjoy cup of coffee\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"modern and clean with smile of workers","id":54},{"phrase":"nice machiato coffee or espresso","id":55}]},{"id":27,"title":"Great coffee","text":"Coffee was great here but little crowded to find a spot to stand or sit down to enjoy the coffee. Nice traditional coffee house deco and varieties of beans to take away for the coffee lovers\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"little crowded to find a spot to stand or sit down","id":56},{"phrase":"traditional coffee house deco","id":57},{"phrase":"varieties of beans","id":58}]},{"id":28,"title":"Best place for Ethiopian coffee","text":"A nice Ethiopian coffee shop in Addis Ababa established over 60 years. Many local people go there for coffee as well. It sells coffee beans and coffee candies as well at affordable prices. Probably the best place to taste the Ethiopian coffee in town.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"sells coffee beans and coffee candies","id":59},{"phrase":"best place to taste the Ethiopian coffee","id":60}]},{"id":29,"title":"great place for coffee","text":"good coffee... both beans to bring home... and to have a coffee with some friends... nice stand-up coffee bar with an art gallery\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"both beans to bring home","id":61},{"phrase":"coffee with some friends","id":62},{"phrase":"nice stand-up coffee bar","id":63},{"phrase":"art gallery","id":64}]},{"id":30,"title":"The best coffe at a cool coffe shop in Addis Ababa","text":"I enjoyed the best black coffe that I had in Ethiopia. And it is a cool place, modern designed. It brings you the best coffee taste experience with what could be a western like spot.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"best black coffee","id":65},{"phrase":"cool place, modern designed","id":66},{"phrase":"best coffee taste experience","id":67},{"phrase":"western like spot","id":68}]},{"id":31,"title":"good vegan buffet! and relaxed lunch.","text":"This lunch stop was part of my day-long Guzo culinary tour. The buffet was good with a mix of salad ingredients and more traditional chickpea stews.\n","coffeeHouseId":5,"filtered":true,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[]},{"id":32,"title":"Yum!","text":"I really wanted some authentic Ethiopian coffee. I got some! Tomoca was recommended from Addis Ababa to Azum. I've enjoyed a few strong cups since I've been home.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"authentic Ethiopian coffee","id":69},{"phrase":"enjoyed a few strong cups","id":70}]},{"id":33,"title":"Nice","text":"Lovely place but the coffee is overpriced for Ethiopia 🇪🇹 The tradition is worth seeing It’s also a known place for tourists to be taken but esp if you go west you will taste and drink better coffee than this\n","coffeeHouseId":5,"filtered":true,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[]},{"id":34,"title":"Coffee is life","text":"The aroma of fresh roast, the brew, the blends, the macchiato. All so splendid. Considered how old Tomoca is, it’s like stepping into a time machine and going back into history.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"aroma of fresh roast, the brew, the blends, the macchiato","id":71},{"phrase":"like stepping into a time machine and going back into history","id":72}]},{"id":35,"title":"Good coffee joint","text":"Tomoca is in my opinion the best mass produced coffee brand in Ethiopia. The coffee shops are normally busy but worth the wait for a decent cuppa. Recommended.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"normally busy","id":73},{"phrase":"worth the wait for a decent cuppa","id":74}]},{"id":36,"title":"A must visit!","text":"At the heart of Ethiopian culture is coffee. Definitely impossible to separate due to its long history of coffee drinking tracing back to the sixth century. \n\nThe family-run Tomoca coffee shop has existed since 1953 and perhaps was one of the few then in the business. \nperhaps the best-known in Addis, You will immediately smell the freshly roasted coffee as you enter. It is often full and busy but service is fast and staff are attentive. The coffee is super good. I also bought their coffee to take home plus cinnamon tea, Addis green tea and the traditional Addis tea. \n\nTomoca is multi awarded and is known to be an ethical brand. Don't miss it.","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"smell the freshly roasted coffee as you enter","id":75},{"phrase":"full and busy but service is fast and staff are attentive","id":76},{"phrase":"bought their coffee to take home plus cinnamon tea","id":77}]},{"id":37,"title":"best coffee shop in Addis Ababa","text":"we had the best coffee in Addis Ababa, and we take also home with us! we recommend this place for coffee lover, the best place and fresh environment see you again\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"we take also home with us","id":78},{"phrase":"best place and fresh environment","id":79}]},{"id":38,"title":"An Addis Ababa institution","text":"This is one of those places you have to go to in Addis Ababa. The original store is the place to visit, although the newer ones serve the same delicious coffee, the original store has the feel and ambience. We were really not sure how to order and a local showed me what to do. You order at the cash register and they give you tokens in the which are colour coded for what you ordered. The options are limited and most people either get a black coffee or a macchiato. You place the tokens in the queue next to the coffee machine and they make the coffees according to the tokens in the queue there. Then you find a spot to stand and drink your coffee, while you chat and \"people\" watch. A really ineteresting and fun eperience.","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"give you tokens in the which are colour coded for what you ordered","id":80},{"phrase":"options are limited","id":81},{"phrase":"most people either get a black coffee or a macchiato","id":82},{"phrase":"place the tokens in the queue next to the coffee machine","id":83},{"phrase":"make the coffees according to the tokens in the queue there","id":84},{"phrase":"find a spot to stand and drink your coffee","id":85},{"phrase":"\"people\" watch","id":86},{"phrase":"really ineteresting and fun eperience","id":87}]},{"id":39,"title":"Coffe tour","text":"I had very strong coffee first time in my life. I am used to drink coffee at least four cup per day. But the coffee I had one cup was enough for the day\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"very strong coffee","id":88},{"phrase":"drink coffee at least four cup per day","id":89},{"phrase":"one cup was enough for the day","id":90}]},{"id":40,"title":"Tomoca","text":"Tomoca is an indigenous Ethiopian chain of coffee makers and their coffee surpassed my expectations.\nThe beans were freshly ground for each cup and meticulously brewed by the master.\nThe place has often a standing instead of a seating arrangement.\nThe coffee is fairly priced and a bit strong for some of us. However, they could offer a generous choice of snacks. The range of snacks is limited.\nThe staff are courteous and helpful.\nIf you like good coffee, you may consider going to Tomoca and you could take away the ground coffee in a can. It’s more purer Arabica than the one in packets.\nTomoca is a must do for coffee lovers visiting Addis Ababa, Ethiopia.","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"indigenous Ethiopian chain","id":91},{"phrase":"beans were freshly ground","id":92},{"phrase":"meticulously brewed by the master","id":93},{"phrase":"standing instead of a seating arrangement","id":94},{"phrase":"range of snacks is limited","id":95},{"phrase":"more purer Arabica than the one in packets","id":96}]},{"id":41,"title":"Delicious coffee!","text":"I'm not a coffee drinker but upon my visit to Addis - the birth place of coffee- I had to try Tomoca cafe.\nI was pleasantly greeted by the aroma of the roasting coffee beans and wonderful taste of my macchiato mmmmmm. I was addicted and for the next several days I started my day off with my macchiato from Tomoca.\nI bought a Tomoca coffee tin can with wonderful 'Ethiopian' themed cartoon explaining the history of coffee. \nThere may a language barrier but everyone understands hand gestures and you will get by.\nThis place definitely deserves a visit.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"aroma of the roasting coffee beans","id":97},{"phrase":"wonderful taste of my macchiato","id":98},{"phrase":"addicted","id":99},{"phrase":"Tomoca coffee tin can with wonderful 'Ethiopian' themed cartoon explaining the history of coffee","id":100},{"phrase":"language barrier but everyone understands hand gestures","id":101}]},{"id":42,"title":"On several trips to Addis","text":"On several trips to Addis I fell in love with this place. Great coffee. Just order a cappuccino and keep the line moving.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"order a cappuccino and keep the line moving","id":102}]},{"id":43,"title":"Good coffee","text":"You can tell the coffee is good from the fact that the place is super busy. It is also possible to buy coffee beans for a decent price. If you happen to be around, it's worth it to spend 15-20 min to try their coffee.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"super busy","id":103},{"phrase":"buy coffee beans for a decent price","id":104},{"phrase":"it's worth it to spend 15-20 min to try their coffee","id":105}]},{"id":44,"title":"Best coffee in Addis","text":"Ethiopian coffee at its best. Coffee with some side pastries, but mostly coffee, and for those who want to take home their famous coffee, there are good packaging options.\nMany locals come here for a coffee break. It’s a happening place and locals are quite friendly. \nThis is an Ethiopian coffee place and,any stand up and drink. Only A few places \nTo sit down.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Coffee with some side pastries","id":106},{"phrase":"good packaging options","id":107},{"phrase":"","id":108},{"phrase":"any stand up and drink","id":109},{"phrase":"Only A few places To sit down.","id":110}]},{"id":45,"title":"Kaffa the home of coffee origin","text":"Ethiopia is known for its best organic coffee and they very in names.yirga-cheffe and Harrar coffee are some of the select brands,sidama,jimma and Jaffa produce plantations. Kaffa is a country rich with coffee fields and the name coffee is derived from that particular countryside.makes sense.\n","coffeeHouseId":5,"filtered":true,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[]},{"id":46,"title":"A Classic That Never Disappoints!","text":"A must when in Addis! This coffee shop is the first of its kind in Addis Ababa, opening in 1953. The name To.Mo.Ca. comes from ‘Torrefazione Moderna Café’ (Italian to English translation is ‘Modern Coffee Roasting’). With several branches sprouting up all over Addis, the Piazza location is the only one you will find with the charm of old Addis Ababa. When you enter in, you’ll feel like you have stepped into the past as you notice the antiques on the walls, newspaper reading locals, standing only, and strangers interacting. There are various regional coffees to taste, and unique gifts to leave with... Grab a bag or tin of freshly roasted coffee to bring a little history back with you!\n\nThe black macchiato is what I order each time I visit. They are the best in Addis! The Sarbet/Old Airport branch also features art exhibits/galleries, my 2nd favorite location to visit.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"only one you will find with the charm of old Addis Ababa","id":111},{"phrase":"feel like you have stepped into the past as you notice the antiques on the walls","id":112},{"phrase":"newspaper reading locals","id":113},{"phrase":"standing only","id":114},{"phrase":"strangers interacting","id":115},{"phrase":". Grab a bag or tin of freshly roasted coffee to bring a little history back with you","id":116},{"phrase":"The Sarbet/Old Airport branch also features art exhibits/galleries","id":117}]},{"id":47,"title":"A place to local coffee lovers","text":"If you are ever looking for a good ethiopian coffee, I will tell you, \"this is the right place\". I met loyal local customers, some frequenting this place for even more than 5 years. Good coffee, good chat, but ofcourse it could be crwoded at prime times. I am fine with that!!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"met loyal local customers","id":118},{"phrase":"Good coffee, good chat","id":119},{"phrase":"crwoded at prime times","id":120}]},{"id":48,"title":"Unique coffee ever seen","text":"One of the famous coffee shop in Ethiopia they have unique atmosphere where you have a tasty Ethiopian coffee while you are standing for a quick service .prices are suitable\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":" unique atmosphere","id":121},{"phrase":"tasty Ethiopian coffee","id":122},{"phrase":"standing for a quick service","id":123}]},{"id":49,"title":"Tasty coffee","text":"Highly recommended by my guide, so had to give it a try. Really great Ethiopian coffee. No place to sit, get your cup and stand near the table. I bought 500 GMS for 240 birr.","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"No place to sit, get your cup and stand near the table","id":124}]},{"id":50,"title":"Good coffee. Bad reception","text":"Do we really out only for eat or drink? In my case No. I go out to eat, drink and enjoy good time as well. At tomoca, undoubtly you will get one of the finest coffee taste but their staff will make you believe that you are not welcome there. Dull faces, rough presentation and poor response. Training is very much needed.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"one of the finest coffee taste","id":125}]},{"id":51,"title":"Authentic Ethiopian Coffee Roastery","text":"Definitely worth visiting. Great ambience and good quality coffee. Got to see Coffea being roasted and also got to buy beans. Great service.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Great ambience and good quality coffee","id":126},{"phrase":"Got to see Coffea being roasted","id":127},{"phrase":"got to buy beans","id":128},{"phrase":"Great service","id":129}]},{"id":52,"title":"Recommended and thoroughly enjoyed","text":"Great coffee - grab some ground beans to take home or share with friends as souvenirs too. Modern setting and good service.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"grab some ground beans to take home or share with friends as souvenirs too","id":130},{"phrase":"modern setting","id":131},{"phrase":"good service","id":132}]},{"id":53,"title":"Original Starbucks","text":"Great experience....the coffee, generations of coffee machines, information on the different types of coffee and the vibe","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"generations of coffee machines","id":133},{"phrase":"information on the different types of coffee and the vibe","id":134}]},{"id":54,"title":"Are you a coffee lover??","text":"Tomoca a power house of a really coffee taste. Don’t miss it if you need a real taste of Ethiopian coffee.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"power house of a really coffee taste.","id":135},{"phrase":"real taste of Ethiopian coffee","id":136}]},{"id":55,"title":"Consistent Service","text":"Whenever I visit Tomoca, the service and taste of the coffee and macciato, espresso is always the same and satisfying. The price is way reasonable. You could be pay more than Tomoca's charge but the taste you are getting from other service providers are not comparable with Tomoca. Their market segment is wisely selected! Good job and keep this up and strive to bright our day :) Thank you!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"market segment is wisely selected","id":137},{"phrase":"espresso is always the same and satisfying","id":138}]},{"id":56,"title":"Quick coffee!","text":"Great place to quickly grab a flavorful coffee, headship there is no sitting area so plan to stay a short while .... the coffee shop might be a bit crowded but on the plus side it has many branches so find the one on your way !\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"headship there is no sitting area ","id":139},{"phrase":"might be a bit crowded","id":140}]},{"id":57,"title":"Mr.","text":"The best taste of Ethiopian coffee in Addis which I regularly enjoy with family and friends. I miss the aroma of the roasted coffee !!!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"regularly enjoy with family and friends","id":141},{"phrase":"miss the aroma of the roasted coffee","id":142}]},{"id":58,"title":"Best coffee in Addis... for locals as well","text":"Packed coffee shop where locals have their coffee standing up at the coffee bar or one one of the high stools / tables. Multiple types of coffee drinks available... in my case I had a Macchiato which, while Italian-inspired, is actually closer to a foamy tall expresso with some milk, but not as foams as a cappucino. They also sell their coffee beans in 500g bags: we bought the \"famigli\" blend which is in between sark strong and brown. Highly recommended. Located in Piazza.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Packed coffee shop","id":143},{"phrase":"coffee standing up at the coffee bar","id":144},{"phrase":" high stools / tables","id":145},{"phrase":"Multiple types of coffee drinks available","id":146},{"phrase":"Italian-inspired","id":147},{"phrase":"sell their coffee beans","id":148},{"phrase":"bought the \"famigli\" blend which is in between sark strong and brown","id":149}]},{"id":59,"title":"Tomoca Coffee is simply the best!!!!!!","text":"Tomoca is my favorite place for my coffee cravings. I went to Tomoca everymorning for coffee and Machiato I was in Addis Ababa. I still get there coffee shiped everymonth; their coffee is top quality hands down.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Tomoca everymorning for coffee","id":150},{"phrase":"get there coffee shiped everymonth","id":151}]},{"id":60,"title":"Family coffee time","text":"Nice cafe if you are up to strong arabica coffee. They also have light roasted coffee beans. It is tasty\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"strong arabica coffee","id":152},{"phrase":"also have light roasted coffee beans","id":153},{"phrase":"tasty","id":154}]},{"id":61,"title":"Great coffee standing up","text":"Don’t expect to sit and chill here. It is all about drinks and go. Fast service and great coffee. Didn’t know Fasting Macchiato is a Macchiato with soy milk. The ginger biscuit isn’t with it. Can do without it. However, the beans are very well priced.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Don’t expect to sit and chill here","id":155},{"phrase":"Fast service and great coffee","id":156},{"phrase":"Fasting Macchiato is a Macchiato with soy milk","id":157},{"phrase":"ginger biscuit isn’t with it","id":158},{"phrase":"beans are very well priced","id":159}]},{"id":62,"title":"Local favorite","text":"Our guide took us to this small crowded spot. We went after lunch & it was packed. This isn't Starbucks. Their 'menu' is quite limited, although they also bave tea. They sell 400g bags of vacuum packed beans and smaller cans of ground coffee. The locals crowd around this small space, drink up and leave. \n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"small crowded spot","id":160},{"phrase":"went after lunch & it was packed","id":161},{"phrase":" 'menu' is quite limited","id":162},{"phrase":"they also bave tea.","id":163},{"phrase":"sell 400g bags of vacuum packed beans and smaller cans of ground coffee","id":164},{"phrase":"locals crowd around this small space, drink up and leave.","id":165}]},{"id":63,"title":"The Best Coffe in Town","text":"Tomoca is known for serving the best coffee in Ethiopia starting from since around 1950. and you will literally know there is Tomoca around by only smelling its unique coffe. they also sell coffee beans in kilos.","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"smelling its unique coffe","id":166},{"phrase":" sell coffee beans in kilos.","id":167}]},{"id":64,"title":"A Stop On a City Tour","text":"LIKES:\n(1) The “energy” of the place. The shop was packed with a lot of locals coming and going.\n\n(2) Prices are quite reasonable.\n\n(3) The coffee is really good and lives up to the hype. I actually purchased a large bag to take back to my home country.\n\nDISLIKES:\n(1) Parking is a huge challenge \n\n(2) There is no official place to SIT and drink. The designated high tables to STAND and drink stay pretty crowded (elbow to elbow).","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"packed with a lot of locals coming and going","id":168},{"phrase":"really good and lives up to the hype","id":169},{"phrase":"purchased a large bag to take back to my home country","id":170},{"phrase":"no official place to SIT and drink","id":171},{"phrase":"designated high tables to STAND and drink stay pretty crowded (elbow to elbow)","id":172}]},{"id":65,"title":"to dark for me","text":"the machiato at Tomoca is amazing but when you order just regular black coffee its a little too strong maybe its cause im a light roast coffee drinker. Over all its the oldest coffee shop in Ethiopia thumbs up for that\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"machiato at Tomoca is amazing","id":173},{"phrase":"regular black coffee its a little too strong maybe its cause im a light roast coffee drinker","id":174}]},{"id":66,"title":"COFFEE","text":"Tomaca coffee at Bole. great coffee and groovy shop fitout. Fusion of old style standup coffee and new fitout. Love Ethiopian coffee\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"great coffee and groovy shop fitout","id":175},{"phrase":"Fusion of old style standup coffee and new fitout","id":176}]},{"id":67,"title":"Best coffee in Addis so far","text":"This place has history, and it’s always busy so you know it’s good. The strong traditional macchiato is my favourite. I’ll be taking some beans home! My guide got us into the roasting room too, and that is an olfactory feast! ","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"strong traditional macchiato is my favourite","id":177},{"phrase":"roasting room too","id":178}]},{"id":68,"title":"Loved the Coffee","text":"The best coffee i had ever in my life! while we are in Addis we have got some time to test the local coffee and we loved it.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"best coffee i had ever in my life!","id":179}]},{"id":69,"title":"A must see in Addis","text":"The coffee was strong and delicious. If you like coffee, coming to this place is almost a bit of a pilgrimage, and you should make sure to put it on your itinerary.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"coffee was strong and delicious","id":180},{"phrase":"coming to this place is almost a bit of a pilgrimage","id":181}]},{"id":70,"title":"Mmmmmm coffee","text":"Absolutely lived up to my very high expectations as a lover of coffee. Macchiato and espresso were exceptional. Husband emptied his suitcase of old clothing so we could pack it with several kilos of coffee beans that continue to make our mornings at home a beautiful thing. I don't know what we will do when we run out of these beans...a coffee run to Addis Ababa, I guess?\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"lived up to my very high expectations as a lover of coffee","id":182},{"phrase":"Husband emptied his suitcase of old clothing so we could pack it with several kilos of coffee beans that continue to make our mornings at home a beautiful thing","id":183}]},{"id":71,"title":"Coffee in the heart","text":"Here is the best of the best, and true best of Ethiopian coffee, Tomoca is the place to go. \n\nOur local guide, took us here and I bought 5 bags of the beans. A great takeaway and fun to watch the locals. \n\neveryone loves a good cup of coffee.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"bought 5 bags of the beans","id":184},{"phrase":"fun to watch the locals","id":185},{"phrase":"everyone loves a good cup of coffee","id":186}]},{"id":72,"title":"Lovely coffee house","text":"If you’re interested in tasting the true flavor of Ethiopian coffee, Tomoca is the place to go. I live inAddis Ababa & have been visiting this cafe at least once a week. I have never been disappointed.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"interested in tasting the true flavor of Ethiopian coffee","id":187}]},{"id":73,"title":"Nice Set up","text":"The setup is inviting. A great place to have a chat with your friend or business associates while sipping coffee. The noise level also is lower for reading newspaper or magazine, which is mainly the problem of most known cafes in addis.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"setup is inviting","id":188},{"phrase":"great place to have a chat with your friend or business associates","id":189},{"phrase":"noise level also is lower for reading newspaper or magazine","id":190}]},{"id":74,"title":"The best coffee house in town","text":"This coffee place has amazing coffee.They have the best coffee in town. I have been their costumer for years now. Even at home I drink their roasted coffee. If you are coffee lover , this place is a must to visit .\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Even at home I drink their roasted coffee","id":191},{"phrase":"place is a must to visit","id":192}]},{"id":75,"title":"Great coffee","text":"Prefer the original branch of the company, where it all started. Small shop, loaded with coffee lovers. Great espresso coffee.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Great espresso coffee","id":193},{"phrase":"Small shop, loaded with coffee lovers","id":194}]},{"id":76,"title":"Not food first experience... will need to try again","text":"I tried the cafe late which wasn't nice as expected. I still need to try the miciato then will decide if worth it.\n","coffeeHouseId":5,"filtered":true,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[]},{"id":77,"title":"Great Coffee!","text":"I visited this coffee shop as part of a Addis Ababa city tour and it was definitely one of the highlights. As an Aussie, we are extremely picky about our coffee and the coffee here was some of the best I've ever had! Bought a few bags of beans to take home. If you love coffee, you'll love Tomoca.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"extremely picky about our coffee and the coffee here was some of the best I've ever had","id":195},{"phrase":"Bought a few bags of beans to take home","id":196}]},{"id":78,"title":"the best place for Coffee","text":"what beautiful coffeehouse my guide local guide took me to Tomoca coffee shop and i many bags off frees roasted coffee beans and i hade one cape of coffee\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"beautiful coffeehouse","id":197},{"phrase":" i many bags off frees roasted coffee beans","id":198},{"phrase":"hade one cape of coffee","id":199}]},{"id":79,"title":"Best Coffee","text":"This cafe and coffee store is a must visit in Addis. Very inexpensive, Buy nicely packaged special coffee.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"cafe and coffee store is a must visit","id":200},{"phrase":"nicely packaged special coffee","id":201}]},{"id":80,"title":"Best coffee and ambiance in town!","text":"t's the aroma of amazing Ethiopian coffee mixed with the old Italian, commerical area piassa makes the experience all the more enjoyable. I particularly enjoy the latte and not so much for the macchiato because the macchiato is too strong! Love, love, love the latte!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"aroma of amazing Ethiopian coffee mixed with the old Italian","id":202},{"phrase":"commerical area piassa makes the experience all the more enjoyable","id":203},{"phrase":"enjoy the latte","id":204},{"phrase":"macchiato is too strong","id":205}]},{"id":81,"title":"go visit tomoca","text":"Definitely a must on any visit to Addis. The coffee is strong and the ambiance is very cool. Don't go for food--they don't serve anything substantial. But the owner is very proud of the place and will answer any questions about his coffee. I was even invited back to see the roasting process...it helped because my driver, Terefe, was friends with the owner! Incidentally, if you need a driver in Addis, call Terefe: 0911674648. A true gentleman--and he drives a yellow association taxi (not the blue taxi).\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"coffee is strong and the ambiance is very cool","id":206},{"phrase":"Don't go for food","id":207},{"phrase":"But the owner is very proud of the place and will answer any questions about his coffee","id":208}]},{"id":82,"title":"dark Coffie","text":"If you like dark roast coffee, it is a good place to buy or drink. They only sell a blend coffee, so that it is useless to ask if the beans are from Yirgachefee or Sidamo. Also don't expect they always have different roasts such as American or Swedish. You will get one blend with one roast anyway.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"dark roast coffee, it is a good place to buy or drink","id":209},{"phrase":"sell a blend coffee","id":210},{"phrase":"they always have different roasts such as American or Swedish","id":211}]},{"id":83,"title":"The Starbucks of Ethiopia","text":"Good coffee, nice place to chill and even have meetings.\n\nScattered anywhere in Addis Ababa this place also sells the world famous Ethiopian coffee variety, Ethiopia is known as the birthplace of coffee.\n\nI can assure you that coffee in Ethiopia taste really different, i like black coffee bit the black coffee of Ethiopia is really really good.\n\nThey have also other coffee mixes not only black.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"nice place to chill and even have meetings","id":212},{"phrase":"The Starbucks of Ethiopia","id":213},{"phrase":"also sells the world famous Ethiopian coffee variety","id":214},{"phrase":"i like black coffee bit the black coffee of Ethiopia is really really good","id":215}]},{"id":84,"title":"Coffee break in Addis Ababa Ethiopia","text":"A couple of locals was asked by tourist(me) and majority agreed Tomoca coffee. I did enjoyed the coffee I had 2 different cafe latte and macchiato both was delicious .I’m not coffee connoisseur it tasted less acidic and smooth and not bitter. Don’t be surprise no pastry. The available snack to pair with coffee was ginger snaps cookie(Ethiopian packaged cookie-you can find in small stores or supermarket.At the coffee shop We bought 3 packaged coffee beans for gifts. GreAt coffee. Be warned no chair to sit or relax and no pastry. The great things was the coffee and locals loved it testament the coffee shop filled with locals and occasional tourist while I was there .\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"2 different cafe latte and macchiato both was delicious","id":216},{"phrase":"tasted less acidic and smooth and not bitter","id":217},{"phrase":"Don’t be surprise no pastry","id":218}]},{"id":85,"title":"Great coffee shop","text":"after following lunch we went to Ethiopian coffee shops, we had coffee with milk.. and had best coffee ever.. we like this coffee shop and better to buy coffee here.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"had coffee with milk.. and had best coffee ever","id":219},{"phrase":"like this coffee shop and better to buy coffee here","id":220}]},{"id":86,"title":"Serving excellent coffee 18 years before Starbucks!","text":"Ethiopians drink more than half the coffee they produce. And in Addis, the 3 branches of Tomoca do their part in supplying caffeine to the locals and expats alike. I particularly liked the University location (the first one, it opened in 1953). Excellent macchiato - my preferred drink!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Excellent macchiato - my preferred drink","id":221}]},{"id":87,"title":"Excellent coffee, cute setup","text":"Small, local set-up serving Bunna, Macchiatos and also selling coffee beans, which we bought tons of :)\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Small, local set-up serving Bunna, Macchiatos","id":222},{"phrase":"selling coffee beans","id":223}]},{"id":88,"title":"Great coffee","text":"If you’re in Addis you have to go to Tomoca to drink a coffee! It’s really good, the place is small and no place for sitting.\n\nYou can buy coffee and tea for good price (cheaper than at the airport) and for gift it’s a very good option!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"place is small and no place for sitting","id":224},{"phrase":"can buy coffee and tea for good price","id":225}]},{"id":89,"title":"great coffee","text":"After lunch coffee became a 'tradition' - whether a proper coffee or a 'fasting' coffee (soy milk) for those so inclined. And popular with the citizens of Addis!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"lunch coffee became a 'tradition'","id":226},{"phrase":"whether a proper coffee or a 'fasting' coffee (soy milk) for those so inclined","id":227}]},{"id":90,"title":"Perfectly roasted...","text":"Ethiopia is said to be the birthplace of coffee... so a visit just makes sense. I visited both the older shop and a newer one in Bole. The older shop delivers more charm and is much more the authentic experience of having an espresso or macchiato like the locals!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"The older shop delivers more charm and is much more the authentic experience of having an espresso or macchiato like the locals","id":228}]},{"id":91,"title":"Coffee institution","text":"A very local coffee house which also sells coffee (ground, beans etc...). The staff does not speak English but it is fairly easy to make oneself understood in the language of coffee.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"very local coffee house which also sells coffee","id":229},{"phrase":"staff does not speak English but it is fairly easy to make oneself understood in the language of coffee","id":230}]},{"id":92,"title":"Great coffee experience","text":"This place serves one of the best coffies in the world , with the finest qualities and expert brew , price is fair and the self service approch makes it all about the coffee\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"serves one of the best coffies in the world","id":231},{"phrase":"finest qualities","id":232},{"phrase":"expert brew","id":233},{"phrase":"self service approch makes it all about the coffee","id":234}]},{"id":93,"title":"Good coffee","text":"Good coffee that it No thing more to say and nothing special You can buy some coffee Ground coffee beans\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"You can buy some coffee Ground coffee beans","id":235}]},{"id":94,"title":"excellent coffe","text":"We had best coffe in this shop. The guide took us this place during the tour of Addis Ababa and we loved the coffee here.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"best coffe in this shop","id":236}]},{"id":95,"title":"best coffee ever","text":"We enjoyed the coffee and cappuccino. Nice relaxing after touring around. They have very good quality of coffee.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"enjoyed the coffee and cappuccino","id":237},{"phrase":"Nice relaxing after touring around","id":238},{"phrase":"very good quality of coffee","id":239}]},{"id":96,"title":"Tomoca","text":"Very good coffee and machiato with fair price and good customer service. I love this place its the best.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Very good coffee and machiato","id":240}]},{"id":97,"title":"Great vibes, Ethiopians style espresso based coffees.","text":"This place is fun. Lotsa local business people come here and it’s great for just soaking up the after hours vibes. Service is great. Drinks are well, good enough. \n\nWith regards to the coffee, let’s just say that most Ethiopian Coffeebars haven’t quite caught up to capturing the beauty of their bean... they tend to over roast their good stuff Macchiatos here are tasty, but far from the 3rd wave coffee standards the rest of the world has set.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"great for just soaking up the after hours vibes","id":241},{"phrase":"Service is great","id":242},{"phrase":"most Ethiopian Coffeebars haven’t quite caught up to capturing the beauty of their bean","id":243},{"phrase":"tend to over roast their good stuff","id":244},{"phrase":"Macchiatos here are tasty,","id":245},{"phrase":"far from the 3rd wave coffee standards","id":246}]},{"id":98,"title":"Great place, Ultimate taste","text":"Had very good quality of coffee. Good place to visit with friends. But most of the time, it is crowded. Still, worth visiting...\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"very good quality of coffee","id":247},{"phrase":"Good place to visit with friends","id":248},{"phrase":"crowded","id":249}]},{"id":99,"title":"Experience at Tomoca Coffee","text":"Tomoca Coffee is a place where you can be the best Ethiopian coffee ever. Even the aroma at the cafe is stimulating and exciting. I highly recommend the place for refreshment.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Even the aroma at the cafe is stimulating and exciting","id":250},{"phrase":"recommend the place for refreshment","id":251}]},{"id":100,"title":"great coffe","text":"A wonderful coffe in an old shop/bar where you can see very antique furnitures and also the mill and the oven where they toast their own coffe\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"wonderful coffe in an old shop/bar","id":252},{"phrase":"very antique furnitures","id":253},{"phrase":"also the mill and the oven where they toast their own coffe","id":254}]},{"id":101,"title":"One of the best cups of coffee I've ever had.","text":"Where to go if you want to drink like a local. Be sure to stock up on beans to bring home because you'll want more and they're expensive (and hard to find) here.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"sure to stock up on beans to bring home","id":255}]},{"id":102,"title":"Great coffee , traveling back in time","text":"A quick stop for coffee. Actually a must Love the interior too, like traveling back in time Also a Good stop for coffee souvenirs\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"like traveling back in time","id":256},{"phrase":"Good stop for coffee souvenirs","id":257}]},{"id":103,"title":"Best BUNNA ☕️","text":"The Historical place with the very great experience of drinking coffee, no extra and just standing the Addis Ababa way.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Historical place with the very great experience of drinking coffee","id":258}]},{"id":104,"title":"Great coffee","text":"Always crowded but a great stop for a macchiato! It will be hard to find a better cup in the city for the price!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Always crowded","id":259},{"phrase":"great stop for a macchiato","id":260},{"phrase":"will be hard to find a better cup in the city for the price","id":261}]},{"id":105,"title":"Best coffee in Addis","text":"A 1950’s coffee bar which sells fresh Harari ground coffee and beans. Just off the Piazza area in Addis. Always full.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"1950’s coffee bar","id":262},{"phrase":"sells fresh Harari ground coffee and beans","id":263},{"phrase":"Always full","id":264}]},{"id":106,"title":"Buzzing authentic italian style coffee with local Ethiopian beans!","text":"Great atmosphere of locals and visitors all enjoying Ethiopian coffee brewed the Italian way, so fresh and perfectly brewed its almost sweet!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"Great atmosphere of locals and visitors","id":265},{"phrase":"Ethiopian coffee brewed the Italian way","id":266},{"phrase":"fresh and perfectly brewed its almost sweet","id":267}]},{"id":107,"title":"My favorite coffee forever!","text":"I love their coffee and their vibe in the shop! It is the highlight of Ethiopia! I have to buy coffee back just to remind myself what the true coffee really tastes like!\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"highlight of Ethiopia","id":268},{"phrase":"have to buy coffee back just to remind myself","id":269},{"phrase":"what the true coffee really tastes like!","id":270}]},{"id":108,"title":"Coffee!! Need I say more?","text":"Stopped in to get some good fresh Ethiopian coffee, and did not disappoint! Very busy but efficient in getting your drink order and into your hands. Had the macchiato and was one of the best, if not the best.\n","coffeeHouseId":5,"filtered":false,"coffeehouse":{"id":5,"name":"Tomoca"},"Keyword":[{"phrase":"get some good fresh Ethiopian coffee","id":271},{"phrase":"Very busy but efficient in getting your drink order and into your hands","id":272}]},{"id":109,"title":"Hi this is my review ","text":"This is looking good","coffeeHouseId":2,"filtered":false,"coffeehouse":{"id":2,"name":"Ammar's Coffee"},"Keyword":[{"phrase":"looking","id":37},{"phrase":"ood","id":38},{"phrase":"","id":39},{"phrase":"good","id":40},{"phrase":"this","id":41}]},{"id":110,"title":"spam","text":"spammmmm","coffeeHouseId":2,"filtered":false,"coffeehouse":{"id":2,"name":"Ammar's Coffee"},"Keyword":[]},{"id":111,"title":"Crostatta","text":"Busy and popular for good reasons. We had various crostatta each time we visited. My Veneto wife like the traditional coffee in the glass cup, but I forget what it is called. Yes, I liked it so much, I bought the t-shirt","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[{"phrase":"Busy and popular for good reasons","id":273}]},{"id":112,"title":"Crostatta","text":"Busy and popular for good reasons. We had various crostatta each time we visited. My Veneto wife like the traditional coffee in the glass cup, but I forget what it is called. Yes, I liked it so much, I bought the t-shirt","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":113,"title":"Crostatta","text":"Busy and popular for good reasons. We had various crostatta each time we visited. My Veneto wife like the traditional coffee in the glass cup, but I forget what it is called. Yes, I liked it so much, I bought the t-shirt....","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":114,"title":"Crostatta","text":"Busy and popular for good reasons. We had various crostatta each time we visited. My Veneto wife like the traditional coffee in the glass cup, but I forget what it is called. Yes, I liked it so much, I bought the t-shirt....","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":115,"title":"Excellent Coffee","text":"Stumbled on this place in January 2022 after missing the Vaporetto to Torcello - it was so good that when we were back in Venice in December we made a special trip. The coffee was so good that we bought 1kg of the Ethiopia Sidamo to take back to London.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":116,"title":"A Truly Excellent Cup of Coffee and Delicious Pastries","text":"The title says it all. We sought it out based on an episode of “Somebody Feed Phil,” and were so glad we did! Excellent and friendly customer service as well. Although a bit out of the way from the main tourist areas it’s definitely worth a stop or two!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":117,"title":"Best coffee in Venice!","text":"Loved this place. Great location near the canal, the staff was very friendly and it’s lovely decorated. Delicious specialty coffee and one of the best chocolate croissants I’ve ever tasted :) great for breakfast!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":118,"title":"A Truly Excellent Cup of Coffee and Delicious Pastries","text":"The title says it all. We sought it out based on an episode of “Somebody Feed Phil,” and were so glad we did! Excellent and friendly customer service as well. Although a bit out of the way from the main tourist areas it’s definitely worth a stop or two!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":119,"title":"Best coffee in Venice!","text":"Loved this place. Great location near the canal, the staff was very friendly and it’s lovely decorated. Delicious specialty coffee and one of the best chocolate croissants I’ve ever tasted :) great for breakfast!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":120,"title":"Excellent coffee shop","text":"Found this gem on line and trip adviser \nAnd was not disappointed either,\nIt was a lovely design coffee shop, \nWith plenty tables to sit, and just on the canal.\nHad the cappuccino there it was lovely, and also had the crosiants a pistachio one too was amazing well worth a visit","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":121,"title":"Good and tasty coffee","text":"Great coffee, tasty. Very busy and open only 7 am to 12 am so be there early if you want have your coffee relax. No shadow on the terrace : another reason to be there early !\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":124,"title":"Fantastic, went there every day","text":"We were so lucky to stumble upon this coffee place that happened to be super close to our hotel and on the way to the centre. We quickly noticed it appeared to be quite popular as people were clearly coming specifically for it. It gets quite busy around 10:00 so if you want to snatch a table outside come early, also no umbrellas so get ready for it to be a bit hot. But the view of the canal is great, the area is so peaceful and laid-back compared to the super touristy centre. We tried cappuccino, espresso and had some of the croissants. It was always lovely, nice service and reasonable prices for Venice. You could see the people there love what they do!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":127,"title":"Ideal place for breakfast","text":"I found this place by accident and I was nicely surprised. Nice interior, good selections of coffee, very tasty brioches and bagels. Kind and helpful staff. Definitely I recommend this place, I visited every day during my stay in Venice.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":128,"title":"Excellent coffee - lots of choices of types","text":"I absolutely must get cappuccino here on each trip to Venice - even if it is nowhere near where I am staying. They have a number of different types of coffees available - all you need to do is ask when ordering. They are very helpful if you describe what you like or don't like in a coffee.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":129,"title":"THE coffee e place in Venice","text":"Very nice e spot, nice people, great coffee, a few tables outside along the water for a venetian breakfast, lots of locals, good croissants, reasonable price, free wifi, recommend 100%\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":130,"title":"Best Cappuccino in Venice","text":"Best Cappuccino in Venice! Really great staff not very fast service but for them it's mystagogue! I also bought some beans for home. Cappuccino only 1,90€! It's a self service shop\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":131,"title":"Solid wifi and café","text":"Came here for the wifi as the place we’re staying has pretty poor wifi. It was much better here. Was a bit of a walk to get to so I’m not sure I’d be back. Definitely cute and worth a visit if you’re in the area in need of wifi and a café.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":132,"title":"Closed but seemed so so nice!","text":"We‘ve been there 3 times on different days and it was closed each time.. I’ve googelt the opening hours and it said 7-14. On other platforms the opening hours varied. But it seemed so nice from the outside and for my next visit I will definitely come back. But a note at the door would be great, because there was no “ we’re closed at the moment”\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":133,"title":"Love this place","text":"Found it as one of the few breakfast places in Venice with vegan options and ended up coming back here every morning during our stay in Venice.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":134,"title":"Cool place!!","text":"Great cup of coffee!  The staff was so welcoming and professional, cool place, good vibes. They make freshly roasted coffee, my favourite place in Venice!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":136,"title":"Delicious coffee","text":"The coffee itself was tasty and there was lots of choice. Definitely if you are a coffee fan and in Venice worth checking out and the area is cool too.\n\nWithout a toilet that customers can use (maybe because of Covid?) it isn't a place that you can currently linger/do work in as much as I'd like.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":139,"title":"Best Coffee & Vegan Pastries in the City","text":"My absolute favorite spot in Venice to grab a table, a cappuccino and a vegan pastry and get to work! Love plugging in my headphones and getting work done while being surrounded by the hustle and bustle of locals alike and out of town guests going in and out, enjoying their coffee, teas and sweet treats. Some of the best vegan treats and coffee in Venice with baristas that can assist you expertly into selecting the perfect drink. You can also let them know what kind of coffee you like to take a bag of coffee home with you! Great location, inexpensive, indoor and outdoor seating, strong WIFI, delicious coffee and assortment of vegan non-vegan pastries and an all around hip atmosphere. Can't recommend this place enough, I love taking all of my out of town guests here!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":140,"title":"Extra service to pay + no toilet","text":"They prepared our coffees at the bar counter and gave us a tray. We then unprepared by ourselves the table we used. Result: we must pay the service at the table, even if we didn’t use it! (10€ for two coffees, one croissant and a small piece of cake) When asked, they said you pay for just occupying the table. \nThank you, you will for sure go far with your kindness! \nPlus, there’s no toilet","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":141,"title":"Brilliant little Cafe by the Ghetto","text":"Superb coffee shop that does brilliant coffees and real tea! Also does an excellent range of cakes to go with your drinks. It's a very nice setting and an easy place to spend time.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":142,"title":"test","text":"test","coffeeHouseId":2,"filtered":false,"coffeehouse":{"id":2,"name":"Ammar's Coffee"},"Keyword":[]},{"id":143,"title":"Great coffee","text":"I've been there before and I made sure to go there again. The staff know how to make proper coffee and they have beans from different origins. It's located in a nice area, outside the touristic zone, although it can be busy at times. There is a nice mix of locals and tourists visiting it. It's a specialty coffee shop, so don't expect large size coffees or foamy cappuccinos\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":144,"title":"Niice!","text":"Cozy, cute place and nice coffee! 👌🏼 Had hard times finding some specialty coffee in Venice, this one didn't dissapoint 🥰\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":145,"title":"Excellent coffee and ambience","text":"Great place with excellent coffee and cake in a great location. Close to the train station and near other food and wine places.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":146,"title":"love this place","text":"what a delightful little coffee shop. i loved the industrial decor of this place, and the atmosphere was very relaxed. the staff were very knowledgeable and helpful. and most importantly the coffee was delicious and well priced.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":147,"title":"Nice coffee","text":"We were on our way walking to our accomodation and needed to have a break and cool down for a while. Came in here and ordered two cold coffees. We were expecting more of an Australian type of ice coffee but when in Rome you do what the locals do and it was nice. The food looked great but we just wanted to have a cool drink and rest for a while. They offer free good WiFi also.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":148,"title":"Bad espresso","text":"Had high expectations, entered the shop and ordered an espresso.\n\nIt was terrible. Little crema, way too sour, barely any flavor. Maybe it was just a bad shot on a bad day, I don't know. But I'm not willing to give it another shot.\n\nI did like the ambience. So two stars for that.","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":149,"title":"Nice","text":"We did a chocolate and cake tour with Monica and she brought us here for the coffee and cake. Both were excellent. Nice place and you can also buy beans here.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":150,"title":"A coffe before hitting the road","text":"Came from Sicily, were waiting for our transportation arangement, were a bit hungry, this place seamed like a good place.\nWe ordered 2 sandviches, the staff kindly heated them for us, and they were realy tasty.\nThe prices are rather steep, but it is realy better than a peace of stale pizza or some premade sandwich.\nThe staff is realy friendy, but you have to stand at the cashregister, otherwise they will not serve you. You check what you want, and then you order and pay.\nAll in all, a good snack, something to keep the big hunger away.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":151,"title":"Great","text":"The coffee here is the best, the prices are reasonable and the location is great. Fast service and friendly staff. Must visit if you are a coffee lover!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":152,"title":"Rude staff, ignores anyone who doesn’t look like a local","text":"We came to this cafe at the recommendation of Emi, who we had the pleasure of doing a rowing excursion with earlier in the day. Emi was so friendly and down to earth, sadly the staff at this cafe were the exact opposite. The barista was rude and snooty. I patiently waited at the front of the counter, trying to make eye contact with him while he repeatedly ignored me to serve the locals standing behind me in line...avoid this cafe if you are visiting the Cannaregio area.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":153,"title":"Torrefazione Cannaregio","text":"We found the best place to drink coffee in Cannaregio. We discovered this coffee stop when we first noticed the huge number of people inside queued up ordering coffee. The obvious reason is the coffee is sensational, the prices reasonable and the setting on the canal sitting at tables enjoying the beautiful weather made this a great place to visit. The two men making the coffee were quick and efficient, making top quality coffee. If you are visiting Venice and in and around the old Jewish Ghetto, this is a must place to call in and enjoy the coffee.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":154,"title":"Great place","text":"Super canalside, modern coffee place. Fresh coffee (from €1 upwards, a little more at a table) and pastries in the mornings(from €1.50 upwards) Decor wooden with tea/coffee chests and wooden floors. They sell coffee to take home too. Friendly young staff. Lots of Italian customers.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":155,"title":"A True Hidden Gem!","text":"Torrefazione Cannaregio has recently moved to a new, larger, location near the Jewish Ghetto. The new location has kept some of the original fixtures such as the brass knobbed coffee bins, however, it has been given a modern twist. \n\nThe coffee is still exceptional quality. It is all still roasted onsite (as the name suggests) and they offer a choice of 5-6 excellent coffees to have as espresso. For a traditional cup i'd suggest the cafe bricola - a blend of 70% Arabica and 30% Robusta coffee. \n\nV60, Areopress and Filter coffee is also now available and the Colombian speciality coffee is excellent. Very fruity but well balanced with some pleasant acidity. \n\nPrices are VERY reasonable - depending on coffee chosen an espresso can be as cheap as 00.90 EUR. \n\nThe staff are very friendly and speak excellent English.","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":156,"title":"Perfect pick-me-up","text":"After an overnight flight from the US, while waiting to get into our Airbnb a few doors down, we decided to stop in for a coffee to try to wake up to continue our touring. It was very hot that day- Europe was in the middle of a heatwave. I didn't really want something hot, but need a jolt. I was relieved and thrilled to see that they had an iced Americano! I had read that iced coffee was not popular in Italy so I was surprised. \nIt was perfect! Cold, refreshing and just the jolt we needed to continue our adventure!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":157,"title":"Amazing Coffee Experience","text":"The atmosphere was lovely and the coffee is unreal! A variety of coffee beans to choose from as well\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":158,"title":"Best Cappuccino of My Life","text":"the barista stated this would be the best cappuccino of my life and he was ABSOLUTELY CORRECT. I never wanted it to end. Take the advice of the baristas and you will not be disappointed!! A great find!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":159,"title":"Best coffee","text":"Worth the walk to a more quiet area of Venice. The macchiato I had was delicious! Very nice place and very friendly staff! Don’t miss it!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":160,"title":"Best coffee of our Europe trip!","text":"The coffee and service there is fantastic. You will find manny locals just standing around as they sip away at their coffee.\n\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":161,"title":"Best coffee in Serenissima","text":"Very good coffee, nice baristas and perfect atmosfere. Please, stay this way, my beloved caffee! Tourists, please, respect the place.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":162,"title":"Superb Coffee","text":"We stopped by here for a morning espresso hit and were really impressed by the the service, decor and overall friendly vibe. Our server was really personable (we have the same Nikon d750 DSLR) and above everything else they serve really good coffee.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":163,"title":"Fabulous coffee, good pastry in a basic, friendly setting.","text":"I stopped by while I was working (on vacation). I ordered a macchiato, and a crostata (I think). The espresso was strong but not bitter. I logged into the wifi and soon ordered a flat white with 2 espressos. the espresso flavor was nice and strong and the drink was silky smooth. The internet worked well. I believe there are some tables on the canal which could have been very pleasant, but it was a bit too sunny out and so I decided to stay inside.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":164,"title":"Amazing stuff and great coffee","text":"The place has speciall vibe, very noce interior. Coffee is so good and staff is very very friendly and helpful. Need to go there\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":165,"title":"Best Coffee","text":"Worth the meandering to this quiet side of Venice. It’s a small but perfect stop to enjoy a great variety of coffee!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":166,"title":"Good coffee and pastries","text":"Went here twice for coffee and pastries. Wide selection of Italian coffees. We were satisfied with them, and with the pastries. Good service, pleasant atmosphere.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":167,"title":"When in Italy ... Coffee & Cornetto Breakfast!","text":"The macchiato is delicious and if you aren't a coffee lover, they will make you a cocoa macchiato with whipped cream. A different selection of pastries every morning to go with the coffees and equally delicious. \nThis is the easily one best coffee experience I have ever had in my 70 years. The first was at Rick's Cafe with Jamaican Blue Mountain roast and a \"brownie\". But sitting next to an acqua alta canal on a rainy Cannereggio day just might be my favorite!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":168,"title":"Coffee as it should be. Worth the trip.","text":"Walked 25min to get here with distractions and picturesque stops particularly along the bridges and waterways. A good experience overall from the friendly staff to the quality of the coffee and cakes.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":169,"title":"Overrated","text":"We came her based on the great reviews. We left very disappointed. The coffee is nice but I don’t feel like I have had a special coffee. \nThe cakes were so expensive that we didn’t want to part money for them. \nThe cafe is in a nice setting next to the canal but with only 2 outside tables.\nCome here if you are passing but don’t go out of your way.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":170,"title":"The best coffee in Venice","text":"Wide selection of excellent coffees and some cakes. We made this our regular coffee stop in the mornings. There are 2 tables outside and a mixture of seating inside. Staff are very helpful. You pay when you leave.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":171,"title":"Bad experience","text":"We came here because of the excellent reviews. However, when ordering a hot chocolate, they said they ran out of it and didn’t want to make new one (although it was only 5.30 pm). They served me the worst hot chocolate I ever had. It was quickly made from some hot steamed milk with powder. Not acceptable to serve this as an alternative. Definitely wont come back.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":172,"title":"A must!","text":"If you’re staying in Cannaregio you must visit this place. The coffee is wonderful and the pastries were amazing! It does get busy and locals seem to just walk to the front of the queue but it’s worth the wait. Can’t wait to go back.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":173,"title":"Nice coffee shop.","text":"We stopped for lunch here during a walk around the Canaregio. It's in a beautiful setting and is tastefully decorated inside. We asked the Barista to recommend a coffee for us form the myriad of bean jars behind the counter, but he seemed more interested in pushing us towards Americano and Cappuchino so we duly obliged. To go with the coffees we had a ham and cheese Brochetta and a slice of apple cake. We settled inside to enjoy our lunch. It was all very nice but pricey at 16 euros. We would have preferred the Barista to talk us through the exotic looking bean jars but he wasn't keen so for that reason we'll give a four instead of a five.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":174,"title":"Probably the best cafe I've had the pleasure of visiting","text":"An amazing and rare set up which allows guests to select their coffee from a range of beans and grinders set up along the bar and complimented by incredibly knowledgeable barista's to guide you in your choice. After trying a couple of flavours and receiving a mini cours on the different flavours from around South America. I was even offered a free espresso so that I could compare the flavours with those we had been talking about. Special thanks to Giuseppe for his generosity and expertise!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":175,"title":"Fabulous cafe - coffe and cakes","text":"Fab choice for coffee and cakes if you're in this area - we stayed just nearby so went for breakfast. \n\nFriendly a acommodating staff, good coffee and fab custard croissant and apple tart. \nWeren't so keen on the hot chocolate but that may be just how they make them in Italy.\nClean, on trend decor. Got busy quickly so we were pleased we go there early for seating.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":176,"title":"Great flat white!","text":"Best coffee I had in Venice - these guys know how to make a great flat white. Selection of cake is good, and the decor is cool. Highly recommend!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":177,"title":"I do not drink coffee but I enjoyed this place","text":"My wife drinks coffee and wanted to visit this place after hearing about it. Its is a little off the main tourist area - which adds to its charm - but easily found if you just follow Google Maps directions.\nWhy did I enjoy it? Because the service was awesome and the vibe of the place was relaxed and welcoming.\nI believe the coffee is great (if you like drinking coffee), and they also have some nice cakes and such snacks.\nTip: Do not be afraid to ask the staff to explain the different beans as they love to chat and describe each flavour etc.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":178,"title":"Nice mild coffee","text":"Very nice coffee. Low prices. Very few tables though to sit . Option to buy coffee beans and cut for any type of coffee machine.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":179,"title":"Pretty coffee shop","text":"Excellent coffee, friendly staff! Many types of coffee beans so perfect for coffee lovers, Try the cappuccino!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":180,"title":"Great value, cozy space","text":"Delicious and decently priced coffee and superb pastry selection. Staff spoke good English, which we hadn't encountered at other establishments in the same neighborhood. It looks to be a newer coffee shop, I hope they continue to do well!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":181,"title":"Nice place, excellent coffee, best Mocca ever!","text":"Perfect stop off-the-beaten track in Venice! Gentle barista and lovely calm location! Don’t hesitate to stop by!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":182,"title":"Coffee stop","text":"Luckily we found this coffee shop on our first morning in Venice, we visited here every morning for breakfast pastry and coffee. Wide choice of coffees, and nice pastries. Lovely staff. Coffee and a pastry approx 3 to 4 euros. \n\nOne of the nicest coffee shops around.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":183,"title":"Didn't get served","text":"Served locals and ignored us, seemed quite a scruffy place. Dirty table and walls. Only one person working, nit recommended.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":184,"title":"The Best coffee I've ever drunk","text":"For sure, very gentle and helpful barista, very nice environment but the most important: the Best coffee I have ever drunk! Tip: try the blend they make: Ghetto!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":185,"title":"Good coffee","text":"Rustic interior, very good vibes. Best coffee I had in Venice. A variety of different roasts available, all of the drinks hand crafted. I would recommend trying the Venexian coffee (ask what it entails). \n\nReasonably prices, it’s such a same to see so much money spent on bad coffee in the main tourist areas when you can come to a place like this for a very honest drink.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":186,"title":"Good coffee and even better atmosphere","text":"We made a special “detour” to visit this place not only for its famous coffee but more for the atmosphere and an experience of walking through more authentic quarters of Venice: a bit shabby, not at all crowded and definitely charming) The coffeehouse overlooks a small canal animated not with the endless kitschy gondolas but with the boat of locals transporting groceries, dogs and even a new refrigerator! It’s like a gulp of fresh air you get there along with a gulp of tasty cappuccino) And at the next table you see an elderly gentleman ( a regular customer, I suppose) reading his morning newspaper with two dogs peacefully sleeping at his feet! So, do visit the place and have a stroll in the quarter to feel the real “living” Venice!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":187,"title":"THE BEST Coffee in Venice!","text":"Amazing selection of coffee and excellent service! Totally local and amazing value for Money!!! Highly recommended for all travellers! MUST visit if you are a coffee lover!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":188,"title":"Lovely","text":"Lovely coffee. Lovely croissant. Lovely setting - many interior seating options or stand at the bar. Lovely service. This shall be my regular morning stop.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":189,"title":"Great Coffee","text":"Great Coffee, really nice shop. If I was being really critical I would say the lack of seating was an issue but it’s not the Italian way.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":190,"title":"Great Coffee Shop","text":"A great coffee shop tucked away in the side streets of Venice. The coffee we tasted on our trip was good so far, but it was even better here. Highly recommended!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":191,"title":"Best coffee of my trip!","text":"I had read about this café before going to Venice so I was eager to try it out. I only wish I had gone on my first day because I wouldn't have gone anywhere else! Not only is the coffee amazing, but incredibly cheap compared to most other cafes. It's quiet and unassuming with a very friendly barista. Can't wait to return!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":192,"title":"What a coffee!","text":"What a jewel for coffee lovers!\nCoffee in Italy is excellent everywhere (so hard to get back home after became addicted), but this establishment took it to another level.\nIndulge yourself with a variety of cups from different types, just be prepared to stay awake at night.\nThen buy some beans to bring back home to preserve Italy's best flavors.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":193,"title":"Our daily coffee dose!","text":"We discovered this place on a google recommendation and were not disappointed! Great coffee, even better pastries (brioche as they call them) and cheaper than most other places in Venice. It’s off the beaten track off a quiet canal and feels like a real local hang out. It had a really nice, understated, modern interior and a choice of freshly ground beans for your coffee. We went every morning whilst in Venice - a must visit!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":194,"title":"Slow service and average coffee","text":"Slow service (even when not busy) and average tasting coffee. Certainly better options to be had nearby\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":195,"title":"Excellent Coffee Roastery","text":"Visit Torrefazione Cannaregio and try excellent roasted coffee. I highly recommend the Forte. Strong, balanced, little acid - just as it should be. Good place to go for exceptional coffee.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":196,"title":"Cozy cafe that celebrates the coffee bean","text":"I tasted as many espressos in Venice as I could tolerate and this was the best by a long shot. It was bitter, with a pure coffee flavor, and smooth. AND it's no more expensive than a regular cafe. There's no seating here, you must stand at the bar with your coffee. The shop is decorated with coffee sacks and they display their beans for sale behind the counter. It reminds me of third wave American coffee shops that roast their own beans. My only complaint was the service: the cafe got busy and the employees plainly ignored me for a few minutes while I waited to pay.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":197,"title":"Lovely aroma","text":"This place roasts its own beans for sale, many options to choose from to buy home. Had a coffee at the bar, it was good, typical italian fragrant caffe. Lovely aroma pleasing to the coffee lover.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":198,"title":"Start your morning off right","text":"Wake up, roll out of bed and meander on over to Torrefazione for a true Italian roast espresso to kick off the morning. We stopped by every morning and sometimes afternoon to kick out caffeine fix with the most delightful cup of joe. This is where the locals drink but travelers are just as welcome and I highly recommend purchasing a bag of their house blend to keep the experience rolling on your trip\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":199,"title":"Really unpolite, almost embarrassing","text":"The staff was really unpolite and they refused to serve me because they claimed that I should have asked for coffee beans and not just for an expresso.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":200,"title":"Loved it.!","text":"As we walked down the street in the middle of the day, we loved this little boutique coffee shop that my husband had seen. The moment you throw your foot inside, your nose comes up with wonderful coffee flavors. We had double esspresso macchiato. Taste was so good. Try it, if you pass by.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":201,"title":"Nice coffee","text":"We found the place coming from the train station. Don't forget to tell barista which italian coffee you like .\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":202,"title":"Best Coffee in Venice","text":"Shh. Don't tell anyone, but this place has the best coffee in Venice. That goes for both the roasted beans on offer and the espresso you can get at the bar.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":203,"title":"THE BEST COFFEE EVER!TRY THEIR LATTE!","text":"Absolutely love it! The best coffee I have ever tried! Latte was amazing! They sell capsules for nespresso coffee machine!!:))\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":204,"title":"Great coffee","text":"After reading all the rave reviews, we made a special trip to find this place to buy coffee as a souvenir for our son. He said it was delicious! Husband had an espresso while we waited and it was also amazing.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":205,"title":"Best coffee shop","text":"I love coffee, and in my stay for 4 days I had a different type of coffee. It was amazing, the blend, the taste and all the experience!! You must try it!! Classic italian coffee shop!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":206,"title":"Great coffee + really quirky shop.","text":"I'm a big coffee lover and every time I go traveling I try to find the best coffee shops, this time I was lucky, this coffee shop was very good.\nThe coffee was very good, but what I loved the most was the decor, the inside of the shops is simply amazing.\nThey roast and grind the coffee in the shop, and the smell is very appealing.\nAll in all a great place and I do recommend a visit.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":207,"title":"Nice Italian coffee","text":"Stop by for a warm cup a coffee. Wish I could have this cup a coffee everyday! Interning the shop wakes you up with the nice smell of fresh coffee and you won't be disappointed sipping that reasonable priced delicious coffee!\nCoffee lovers must try it out!!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":208,"title":"Fantastic coffee","text":"What an incredible coffee bar! A must visit when in Venice. Bonus finding another branch in the airport when going home.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":209,"title":"An authentic coffee with an Italian flavor","text":"It was a wonderful experience. Professional staff that served us one of the best coffees and chocolate expresso that we ever tried. I highly recommend it.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":210,"title":"Too famous to make a good coffee now","text":"Previously it was my favorite coffee place in Venice, but today they've made me something unpleasant. They use very bad quality coffee beans by default (overfried = cheep) :( This is very sad!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":211,"title":"Real Italian Coffee","text":"One of the best coffee houses in Venice, you see it as it filled with locals and tourist, if you are around it is a must!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":212,"title":"coffee","text":"A great spot where you can get a fresh espresso from the same location that the beans were roasted. I typically get an espresso and whole beans to take home. The staff were friendly and tolerated my broken Italian when ordering.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":213,"title":"Nice coffe","text":"Very cute place not too big but they do have lots of coffee and they also roast it and grind it there. Very nice selection of coffee. The price for the coffee to drink is normal not expensive.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":214,"title":"Great coffee","text":"Nice place to start Venice tour if you are coming by train. Don't forget to tell barista which coffee you like the most and he will prepare you excellent shot of Un caffé.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":215,"title":"Tourists will love this","text":"Look - there is no escaping that this restaurant is on the edge of the tourist areas of Venice. Not quite as busy as St Marks or Rialto but busy none the less. The restaurant has tried hard to aim for authenticity and it shows. The menu was excellent with lots of choice. It leaned towards expensive but no more than many other places in the heart of Venice.\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":216,"title":"A coffee experience to remember!","text":"The beautiful coffees which are imported and roasted in-house are a revelation. The service was impeccable and friendly. We came back the next day just to make sure. We were right. Perfect!\n","coffeeHouseId":1,"filtered":false,"coffeehouse":{"id":1,"name":"Torrefazione Cannaregio"},"Keyword":[]},{"id":217,"title":"Speciality coffee at its best","text":"Without doubt the best coffee around…. Great selection of beans to pick from and excellent service… A real coffee shop that has earned its name a ‘specialty coffee house’\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":218,"title":"great experience","text":"The most beautiful cafe to spend time in Istanbul. especially the coffees are great. their cheesecakes are fresh and delicious. Staff are friendly, prices are reasonable\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":219,"title":"Almond Latte - yes please","text":"Attended this cafe everyday for a week whilst staying in accomodation near by.\nOnly place I found almond milk!! Yes had a almond milk latte every morning by the well experienced barista Ozlem. She was so friendly pleasant and accomodating by far it was my happy place for hours every morning from 0700 to about 10:00. \nThe ambience is faultless and the croissants were fresh and tasty. Couldn’t ask for a better way to start my day. \nAs a Aussie it’s vital to start your morning with a caffeine fix and this place is it. \n100% advised to pay this cafe a visit.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":220,"title":"Great coffee!","text":"The coffee and croissant were really nice. The cakes looked nice. Most people were having these but I didn't want something sweet. This is proper coffee. Big choice of drinks, cakes, pastries and savoury items. They have breakfast too in the morning. Busy. Nice atmosphere and great music. Staff are friendly. Service is good. Fast wifi. Indoor and outdoor seating. Great place to escape from the busy area outside. My small negative table was dirty which should have been cleaned. Waiter did however clean it as we sat down so may be an oversight.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":221,"title":"One of the Best Cafes in the city","text":"So we just happened to stumble upon this place while we were in Istanbul. We ordered pancakes, roast beef sandwiches, iced coffee’s, americano and a cappuccino. Everything was on point. The vibe here was awesome. The sandwiches were some of the best I’ve had in Istanbul. The coffee was flavorful. Service was with a smile and we felt very welcomed.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":222,"title":"Decent coffee and welcoming staff","text":"We liked Coffeetopia as there is a wide variety of coffee-based drinks including those on vegetable milk. The staff understands English and can speak it, feel free to ask for the Wi-Fi password or additional sugar. The air-conditioning wasn't working well enough both times we were dropping by. But it was baking hot outside so we were still relieved! I took a cappuccino on coconut milk and it tasted bomb!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":223,"title":"Best coffee in town","text":"I guarantee you the best coffee in town ! , Super friendly staff super coffee and yummy food! Can’t find anything not good for this place ! It’s perfect Special thanks to özlem !\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":224,"title":"The Best Cofffee & More","text":"We discovered this coffee joint and it was by far the best coffee we drank! They also have so much variety, juices, desserts, great granola fruit bowl, and pastries.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":225,"title":"So good !","text":"Macarons, hot and cold coffees all of these best. You should visit if you come to İstanbul. Same time employees are very sympathetic.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":226,"title":"With passion for coffee....","text":"Don’t miss this place. The coffee is superb no matter which type you go for, Turkish or whatever the huge menu or the baristas are offering. Great tasts and very good and friendly staff!\nLocated not far from the busy spice marked Egypthian Bazaar.\n\nStrongly recommended\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":227,"title":"Excellent coffee bar","text":"Fresh and delicious cakes, excellent coffee and fabulous staff!!! Cozy atmosphere! Highly recommended, you won't be disappointed!!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":228,"title":"By far the best in Istanbul!!!","text":"By far the best place to drink coffee!!! Great coffee quality , delicious desserts English speaking staff !! This place is so tasteful and spotless!!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":229,"title":"Top quality coffee","text":"A truly high quality coffee in the heart of Istanbul. They serve the now famous \"Specialty Coffee\", which includes a large groups of coffee brewers in the world committed to quality.\nAmazing coffee and cappuccino/latte.\nMoreover, desserts are also good, and the staff is friendly and professional.\nWell done!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":230,"title":"Great place.","text":"Very nice place with good variety of soft stand coffees. Sweets are very tasty. Prices are very logic.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":231,"title":"Amazing V60!","text":"We went twice to this place during our one week stay in Istanbul. It's a 3 stories cofffee place with a variety of foods and drink options. Their menu is in english and the staff are nice and friendly. You can sit there for hours, charge your phone or use your laptop. I tried they V60 red coffee and it was the best that I ever had, we also tried their pasetries and pancakes and everything was tasety and fresh.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":232,"title":"Melbourne coffee found in Istanbul","text":"The best in Istanbul! I am from Melbourne (Australia) so a coffee snob and let me tell you these guys meet all expectations! You will never be disappointed. They serve soy, coconut and almond milk ✅ which is the hardest thing to find in Istanbul\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":233,"title":"Coffeetopia","text":"I've tried coffeetopia Eminönü, little coffee shop. Value for money: great. Nice coffee quality. Fresh products . I kindly recommend this place.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":234,"title":"coffee topia was a good experience coming many times","text":"Turkish coffee and cheese cake amazing clean place nice stuff small but good choice for take break to try special coffee good prices\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":235,"title":"Don't go anywhere else","text":"Great coffee, great service and they know what they are doing. I am what you call a coffee snob and most cafes will do okay coffee and sometimes by chance it's quite good but the staff won't be knowledgeable in coffee. These guys however are knowledgeable and whatever cup of coffee you choose, the coffee will be brewed properly and will taste great. You have the choice of a variety of coffee beans and types of coffee brews. Highly recommend here in Istanbul for your daily coffee.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":236,"title":"Best coffee","text":"Highly recommend. Great coffee and cheesecakes, in clean relaxed atmosphere. Staff are friendly, and super-efficient. Range of teas also available. Great place to rekindle your energies in busy istanbul.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":237,"title":"Great coffee experience","text":"The best cafe in historical area of the city. Friendly staff and very clean place to go for coffee. Also their caffees are the best.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":238,"title":"Tasty vegan coffee","text":"The personal is very polite and cheerful. Vegan coffee from coconut milk is very tasty. Every time we come to Eminuni we visit this place. Keep up the great work! 😊\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":239,"title":"Good coffee house","text":"Good cafe, nice staff good service and delicious desserts and great coffee options cold and hot, filtered coffee.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":240,"title":"Excellent coffee and prices","text":"I visited on a weekday morning. Ordered at the counter and sat outside. Excellent coffee, good value for money and professional service. As well as wifi access.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":241,"title":"Good coffee selection and good prices","text":"Very good cappuccino and the nice spirit of artisan coffee roastery. Istanbul is mainly for Turkish coffee, but if you miss good cappuccino or latte, come here! Wide selection of coffee, coffee menu with pictures and prices are not extremely higher than in other. Highly recommended!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":242,"title":"Excellent coffee","text":"We had really great coffees here (the Australian coffee influence is noticeable) and the owner was really friendly. Highly recommend!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":243,"title":"Great coffee and cake - even have soy milk!","text":"Great coffee and cake. Our group was very happy with the quality. It may not be the cheapest, but if quality is what you are after, you won't be disappointed.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":244,"title":"Very satisfying experience","text":"I went there with my husband first time in 2016 and we could not stop going back there again and again whenever we are close to the shop,for the excellent coffee they offer,helpful staff,then we discovered the new branch in the Asian side in bagdat Avenue,bigger,very peaceful,service is quick, coffee is amazing, variety of desserts,nice sandwiches, they have a drink called Golden Berry Fizz it's a Cold Brew Coffee, I have never tasted anything like it, a must try specially in the summertime.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":245,"title":"Good coffee spot","text":"Good coffee place on the main shopping street. Lovely modern deco. Good coffee choice. And spoiled for choice, Chemex, V60 and Aeropress all there and you can choose coffee beans. Nice, friendly staff.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":246,"title":"Good","text":"A friend recommended me this place and I must say I wasn't disappointed. Great variety of coffee with affordable prices. Their desserts also look amazing and really tasty! \nCafe is pretty small even if it is on tree floors so it was really crowded inside. We only managed to find a table outside. \nService is not the best, but over all it's a good place to drink quality coffee.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":247,"title":"Peaceful","text":"Coffeetopia is peacefulness in the hectic heart of Istanbul. The drinks are lovely, the food is good en the staff is friendly and ready to serve you kindly with a smile.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":248,"title":"☕️Coffee of world / world of coffee 🌍","text":"Cosy coffeetopia takes you to warm winter home atmosphere with delicious exotic coffee in a cold day. 😌It’s at historical crowded district. That’s why great place to have coffee break for visiters☕️\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":249,"title":"Very good and cosy place","text":"Totally recommended for having a good turkish and modern taste of the local flavors. They also sell western food such as pancakes for breakfast and they attend you in perfect fluent English.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":250,"title":"Excellent coffee and breakfast foods","text":"We stayed round the corner from this place so went a few times for breakfast and coffees. Such good coffee and a great selection of breakfast foods. Also a nice selection of tasty baked goods, yoghurts and desserts. Very good service by they staff and on the first day they gave us a loyalty card so we used it several times so on the last day got free coffees! Has nice things to buy to take away too. Small tables and quite close together but has a nice shaded area to cool off in in the heat. Good spot for watching people coming and going. Definitely give it a try if you are in the area.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":251,"title":"Excellent","text":"Very good place with good prices near bazzaar, European quality that is rare here... I recommend this place!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":252,"title":"Western-style coffee nearby Eminonu","text":"A casual coffee shop with a different style of brewing (pour over, Aeropress). Didn't try desserts or anything since I was on a rush but, coffee is decent and service is really slow. Well, at least serving style is great, they have those fancy cups that cover the flaws\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":253,"title":"Worst waitress ever","text":"It has been my worst experience in Eminonu. Last week I sit at first floor and they make me wait for 10 minutes to take my order. Then I wait for 25 minutes but no one bring my order just one espresso. Then I decided to left but when I went downstairs and said that I wouldn't wait more, waitress got angry and shouted at me \" you need to wait, we are just 3 people, we are trying\". But funny thing is there was only 4 or 5 tables.\n\nI never suggest this coffee shop to anyone.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":254,"title":"Great place","text":"Great service, very comfortable, friendly staff and ideal place after shopping in eminiou. Pancakes a granola were beaut!!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":255,"title":"A very good coffee!!","text":"Good coffee and good staff, the perfect place to do a stop in Estambul. It is near to Eminonu Tram stop.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":256,"title":"Beautiful coffee shop","text":"The wife and I found them by accident after a long day of shopping. The place looked inviting so we decided to give it a try and were not sorry. The guys were friendly, good humoured and they were playing 80's music (my era). The coffee was really good and they served the best red velvet cake I have ever tasted. The experience was so good we returned two days later for the same order. Next time I'm in Istanbul, I'll be back- Thanks guys.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":257,"title":"Nice Coffee","text":"I was go there with my mom and it was very cute place i recommend you and must try other desserts:))))\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":258,"title":"Very good and very tasty!","text":"Very good and very tasty! Highly recommended! Various kinds of coffee and deserts will make you happy! :)\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":259,"title":"Coffee and breakfast nibble","text":"Lovely espresso and filter coffee. Really accommodating too; my mum is a coeliac and she brought her gluten free wraps and they made breakfast with them for us. There was also a miscommunication with our order and they fixed it for no extra cost and let us keep the extra drink. Thanks guys, we’ll see you tomorrow morning\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":260,"title":"Best (western taste) coffee in Istanbul","text":"If you are struggling with Turkish coffee and \"nescafe\" coffee then drop in here and savour a familiar taste. We did, several times!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":261,"title":"Well Deserved Reputation","text":"We stumbled upon Coffeetopia as we were walking from the Eminonu ferry terminal after a day-long cruise on the Bosphorus. Perfect ending to a perfect day! My flat white and vanilla macaroon were just what I was looking for, and after his cortado and raspberry macaroon G would have been perfectly happy to order another dozen of them and sit right there and eat them with another coffee. Who cares about calories and caffeine at bedtime, when there's Coffeetopia and raspberry macaroons!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":262,"title":"Great place","text":"The macaroons are really good!! I highly recommend the pistachio and the raspberry. coffee is great here too! Service is quick and staff are really nice and helpful. I can safely say that this is one of the best cafes in Istanbul\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":263,"title":"Nice salep","text":"Cofeetopia that me and my friend visited is in the corner of one Kadikoy street.It is nice place to have a cofee during the day..in the night also very good because of the terace. They have very good salep. All in all nice. :)\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":264,"title":"Refreshing juices on a hot day","text":"Nice place to sit and relax and people watch. I had a couple of different juices and they very good. The staff was pleasant as well.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":265,"title":"Morning booster","text":"Take the effort to start your day earlier with breakfast here. This cozy coffee house is so comfortable that you can spend the whole morning people watch, enjoying coffee, or striking up a conversation with the English speaking staff or fellow travellers. The breakfast selection is freshly made and the ambience is fully relaxing but at the same time energises you for the day ahead. Did I mention that coffee and breakfast for two costs less than US$6?\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":266,"title":"For Coffee Connoisseurs","text":"Coffee is amazing, made just the way you ask, cakes are fresh and tasty, the staff are friendly and always smiling which is rare in Istanbul, the location is perfect as it is close to all the tourist attractions. Always the first place for me to go when I get to Istanbul.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":267,"title":"Wonderful coffee, food and service","text":"Coffeetopia opens at 7 am for breakfast and my wife and I went there every morning during our trip. We are both so happy to have discovered this place, which offers a good range of high quality coffees and fresh juices. Also on offer are a host of tempting cakes with generous portions - I think we must have tried most of them. Staff are friendly and English speaking. You can sit inside with the AC or outside and watch people come and go. For such good food and drink, the prices are astonishingly affordable. We were fortunate to come to Istanbul at a time of Lira weakness. Prices were about half the levels in China and the quality was better by far.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":268,"title":"Stopped by for a short coffee break","text":"It’s my second time here and it’s a great place. The staff is super nice, the coffee is delicious and desserts are super yummy. Difenetly recommended!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":269,"title":"good coffee","text":"nice place, really good coffee and delicious deserts make for the perfect stop in instanbul. recommend it\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":270,"title":"Mukemmel","text":"Arkadaslarimiz ile bugun ugradik ve cok begendik. Kahveleri tatlilari sunumlari mukemmel. Calisanlar yardimsever ve cok arkadascil. Herkes guleryuzlu. Mutlaka buraya ugramanizi tavsiye ediyorum.\n\nWe visited this place with our friends. Coffees and desserts are awesome. The staff is also very friendly and helpfull. I strongly recommend everyone to visit this awesome place.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":271,"title":"Great coffee... love it","text":"Stumbled upon this beautiful little coffee shop, while strolling the streets of Istanbul. Okay it’s not so little, I think it has 6 levels. Let’s face it, we all need our coffee fix some time. We actually went back a second time, in 2 days and with all the eating venues around Istanbul we rarely stop at a place twice. The cappuccino, flat whites and hot chocolates all amazing....the desserts great and the crumpets and muffins all yummy. Great and friendly service.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":272,"title":"Excellent Coffee","text":"Very good espresso coffee in the old part of the city. In the pedestrian street so it is not noisy. Near to the bridge with very good view.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":273,"title":"Very nice place","text":"Tried three different kinds of dessert and jasmine tea. Everything was served quick and tasted delicious. Good for family visits. Thank you!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":274,"title":"Trendy coffee joint that will not disappoint","text":"Friendly expert baristas serving up excellent good value coffee in a modern slick setting. Plenty of fresh pastries and deserts. So pleased we stopped here for a taste of home. Thanks for the vote if you found this review helpful.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":275,"title":"coffee","text":"it is the best coffee in whole istanbul...unique italian coffee:) with perfect style..:)the cake is ameson:)\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":276,"title":"Wonderful Coffee","text":"One of the best coffees I have had anywhere in the world. This place is perfectly located and presented. Even sat outside using wifi after my coffee awaiting uber. The place is spotless and excellent staff\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":277,"title":"Must visit","text":"We visited this Cafe several times and it never disappointed. We ordered each time something different and it all tasted beyond delicious. We tried lemon cheesecake, raspberry cheesecake, chocolate crepe cake and chocolate cake with forest fruits each time with turkish coffee of course. The staff was friendly, the atmosphere is beautiful and the prices are good (each cake 12 TL and the coffee 8,5 TL). Definitely worth a visit.\n\nWir verbrachten während unseres Aufnethaltes in Istanbul mehrere gemütliche Stunden dort. Das Cafe ist wunderschön eingerichtet, das Personal mehr als freundlich und die Preise sehr human (12 TL für ein Stück Kuchen und 8,5 TL für den traditionellen türkischen Kaffee). Wir probierten den lemon cheesecake, raspberry cheesecake, chocolate crepe cake und chocolate cake with forest fruits, es hat alles super geschmeckt. Auf jeden Fall einen Besuch wert.\n\nلقد قضينا وقتا ممتعا في هذا المقهى. العمال كانوا لطفاء جداً والقهوى و الكعك بجميع انواعة لذيذة المذاق. انصحكم زيارتها بشدة.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":278,"title":"Best coffee","text":"Turkish coffee is nice but this placed brews great Americano coffee. A gem of a place. 2 mins from spice market.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":279,"title":"Amazing coffee and pancakes!","text":"Great find in the heart of Istanbul. Fantastic coffee and pancakes were delicious. Great service - highly recommend!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":280,"title":"Great coffee!","text":"So good to find good coffee overseas (often so difficult!). Coffee was just like home in Australia, perfect! Really impressed to read about Australian owner's journey to open this business. Great atmosphere here too! Recommend a visit, I've also recommended it in my review of our hotel which was close by.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":281,"title":"For coffee lovers!","text":"In the land of black tea, this is a hot spot for coffee lovers. Near the Spice Bazaar, in a cozy ambiance with 3 different floors and a esplanade you can rest from the busy Istanbul and drink a coffee in a very interesting place dedicated to coffee. Don't miss it after the visit to Spice Bazaar.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":282,"title":"Great quality coffee","text":"Great and quality coffee, nice staff who speak English, fresh patisserie and great cakes. Went there several times for a coffee and would go again. Recommend.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":283,"title":"Coffee & breakfast","text":"Nice small cafe in Eminonu with friendly staff and good coffee alternatives. You may find delicious cookies, pastries and croissants for breakfast. Highly recommended.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":284,"title":"Simply, fantastic","text":"Great place, very friendly people- I tried their cappachino and pancakes. Superb. Will definitely stop again.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":285,"title":"Fresh coffee","text":"I have tried black eye coffee. It was amazing. I have experienced so many boutique coffee .i think one of best coffee in istanbul. I highly recommend this place.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":286,"title":"Extremely good coffee","text":"Great atmosphere fantastic coffee and te Free WiFi Toilets are clean and the service fast and impaceble.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":287,"title":"Chemex","text":"Ideal for quality coffee and for a real break if you are around Eminonu for some reason , also the employees are very kind and polite 😋😊\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":288,"title":"Great flat white!","text":"Really good coffee (I went for a flat white) and a great range of cakes to go with it. I particularly enjoyed the raspberry cheesecake which had a real flavoursome base. Highly recommend!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":289,"title":"Just a quick st","text":"If you are in Eminönü for some reason and need great coffee Caffeetopia is a great little place to stop. With friendly staff and a long list of coffees to chose from, you won’t be disappointed. If you are not in the mood for caffeine there are a few healthy choices such as freshly squeezed juice mixes. Even though I didn’t get a chance to taste their dessert, they all looked appetizing. I plan on stopping there to try other items on their menu next time I am in Eminönü.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":290,"title":"Great Discovery; Great Location","text":"Very happy we discovered this wonderful coffee shop very close to the Eminonu pier and tram stop. Everything about this little gem was first rate: the coffee, hot chocolate, and the food. The staff is extremely friendly and helpful. A great place to take a break from exploring the Grand Bazaar and Spice Market.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":291,"title":"Coffee in Istanbul","text":"If you are going to visit an Istanbul, you have to definitely stop for a best coffee and great fresh juices in Coffeetopia. Flat white is perfect, probably the best we have ever had. I can recommend fresh mixed juice called Booster - very helpful, if you doesn´t feel well because of being cold or in the morning after huge party. \nOwner is very nice lady from Australia, so if you are lucky, you might see a kangaroo or Angus Young there. \nAwesome service.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":292,"title":"Best coffee in Istanbul!","text":"If you want amazing coffee with a cool laid back atmosphere and warm friendly service then Coffeetopia is your place! This is our go to place at least once a week on our way to work. No matter what type of coffee we order it is always perfect.\nThe food is equally as good.\nIn a city filled with coffee houses, this is the one we would highly recommend to anyone in Istanbul. Once you go there you'll be hooked!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":293,"title":"The Best Cafe' in Istanbul 👍🏻","text":"I like everything in this cafe' 😘The coffee , the juice , the deserts and the bakers 😍😍 The staff are very polite and friendly\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":294,"title":"Cozy oasis in the middle of chaos","text":"I was in Istanbul for 3 nights and made it a point to come here every day. After site seeing and walking around the hectic city, this is the perfect place to come unwind. The cold brew is the best I've had anywhere in the world (I'm American) and their pour-overs are great as well. The only food I tried was the grilled chicken sandwich. It's a generously sized, well prepared hot sandwich with a large salad. The staff is very warm, English-speaking, and know their coffee.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":295,"title":"Cool (literally and actually!)","text":"We were seeking respite from the summer heat and found this little quaint, hipster-looking place tucked away in a corner. Had some lovely drinks, friendly staff (and they kindly let me charge my phone too!).\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":296,"title":"Amazing!!","text":"One of the best coffee I ever had! Really a must visit! Amazing coffee, amazing service, amazing atmosphere!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":297,"title":"Excellent!","text":"They prepare the coffee with devotion and you can taste it. If you are near to Egyptian Bazaar this is a good place to stop and drink coffe. Keep the good music and the enviroment, good job!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":298,"title":"Real speciality coffee","text":"Among the turkish coffee experiences, we were looking for a speciality coffee in Istanbul. Finally found Coffeetopia by reviews and we were very happy of our choice. The speciality coffee specifically the red coffee was great. Staff were english speaking and helpful.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":299,"title":"Excellent coffee and bakery in Istanbul","text":"Coffeetopia has a great vibe and friendly staff. Service is going to be slower than major coffee chains, but everything is always fresh and excellent: flat white, drip coffee, lattes, pancakes, croissants, danishes and sandwiches are all great.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":300,"title":"At center of City","text":"Cold drip coffee available. For sure it's one of the best coffee house at Istanbul. You should try! Friendly:)\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":301,"title":"Try Black Eye","text":"This is one of the best coffee shops in Istanbul that I visit almost every week. Really high quality place. Standart products like filter coffee or americano are also good but once you are here, try their speciality coffees. The Black Eye is my favourite lately which is prepared by putting two shots of espresso into a mug of filter coffee. I recommend it if you like strong coffee. Try Dead Eye even if you like stronger.\n\nOne more word for the staff. They all have superb personalities one by one. I did not even meet one bad person. If you don't know well about coffee or just need help about something else, don't feel shy. Ask for their support and they will help you.\n\nIn short, as a local I strongly recommend you to come this coffee shop and enjoy your drink. You won't regret it.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":302,"title":"tasty coffees","text":"i like this little coffee should. they have special and deli coffees. whenever i go to Eminonu i definitely grab a coffee.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":303,"title":"Beautiful","text":"This was a lovely Warm, cosy, clean venue, staff were friendly polite and welcoming, they serve great coffee and great muffin. 😍😍😍\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":304,"title":"Why did I find Coffeetopia on my very last day in Istanbul?","text":"Great place to relax after some heavy sightseeing and shopping. Great coffee, sandwiches and cakes at very fair prices. The café had a very laid back feel to it. The staff were very friendly, and there is free WiFi (and very cool toilets).\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":305,"title":"Cosy atmosphere, friendly service and great cappuccino","text":"I was looking for a nice spot to have coffee and I found the almost perfect one. And it's not only for the great cappuccino but for tasty salads & snacks too. Can't wait to be back!!!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":306,"title":"Great Coffee, Great Cakes","text":"The selection of coffees both hot and cold was good, and on the two occasions we were in the cafe found the coffees served were strong, fresh and of a good quality\n\nTheir selection of cakes (you can see them in the outside display case) is worth mentioning. In particular their Chocolate Cake is outstanding - only a fear of putting on too much weight stopped me from guzzling second helpings.\n\nThe ambiance is good and the service friendly and patient\n\nI will certainly be going here again next time I am in Istanbul\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":307,"title":"Nice coffee but pricey","text":"Saw this place and instantly craved a coffee. So I went in and purchased a Cappuccino which cost a whopping 9TL. I had bought decent coffee elsewhere in Istanbul that was cheaper and larger than this. The coffee was tasty though.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":308,"title":"Great coffee. Free Wifi","text":"Boutiquey. Footpath and inside seating. Good service and great coffee. Take away or have in. Artfully decorated. Great place to sit in the sun with a value for money coffee. And their own wifi with no annoying codes sent to your phone (if you have one). Glad I found this place and will be back in future.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":309,"title":"Good coffee & vibes","text":"I love the decoration of the place also the stuff are really friendly and nice the coffee was good I ordered iced latte it's located next to my hotel so it's a most before I leave\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":310,"title":"Best Coffee in Istanbul","text":"Took some time to find this place but it was well worth the time as the coffee was perfect! Also comes in takeaway cups with lids so you can still walk around and enjoy your coffee too.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":311,"title":"Coffee desire","text":"After all day in market in hot summer day I took a break in coffeetopia that I heard about from barista teams. I knew there was a capable Scae man behind that francise. My expectation was more then I had today to be honest. However still I had two cups of coffee. In the same area there is one more coffee shop but the coffeetopia seems more experienced. \nOn the other hand as Italian said 4M for best coffee is not stable yet. Hope coffeetopia will do better. By the way the music was too distracting. \n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":312,"title":"EH better places to go","text":"Ill admit... the coffee was good. but for the atmosphere of the place and the level our touristy it is there are so many better places to go in istanbul than this! don't waste your time :)\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":313,"title":"Rude","text":"Didn't have coffee as we tried to give it a chance as we stumbled upon the shop, yet the staff were rude from the beginning hence we decided to skip it. Not expected\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":314,"title":"For a good brew!","text":"Stumbled upon this gem on our morning walk around Istanbul. The menu features a variety of your favourite caffeinated drinks, juices and teas. It's great for a stop off destination to get your coffee fix for your next point of call. Great coffee, would recommend!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":315,"title":"Best 3rd wave in Istanbul","text":"If you want to have a perfect coffee in a 3rd wave coffee shop in Istanbul, this is the right place to be. You can find very high qualified single origin coffee beans including cup of excellence. There is also a great variety of food choices including croissants, sandwiches and cakes. Besides espresso based drinks, you can also enjoy cone brew, aeropress and syphon brewed coffee here. Go there and enjoy it.\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]},{"id":316,"title":"Excellent coffee around the Spice Bazaar","text":"We opened trip advisor while we were around the spice bazaar as i wanted good coffee in a non touristic area and my bf wanted to grab a bite.\nSo based on nearby we picked the place and found it very closeby.\nNice trendy decor, smiley staff, the place looked like a real coffee shop.\nWe opted a japanese siphon brew for coffee and sat by the bar to watch its preparation.\nIt was such a treat to attend the preparation rituel, we enjoyed a lot, the staff were very welcoming and fun. The coffee shop s outside seating is great as well. My bf s sandwish was delicious.\nEnjoyed it a lot!\n","coffeeHouseId":6,"filtered":false,"coffeehouse":{"id":6,"name":"Coffeetopia Eminönü"},"Keyword":[]}]