[{"coffee_shop_name":"Torrefazione Cannaregio","title":"Fabulous coffee, good pastry in a basic, friendly setting.","text":"I stopped by while I was working (on vacation). I ordered a macchiato, and a crostata (I think). The espresso was strong but not bitter.  I logged into the wifi and soon ordered a flat white with 2 espressos.  the espresso flavor was nice and...More","keywords":["friendly setting","expresso strong but not bitter","espresso flavor"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Amazing stuff and great coffee","text":"The place has speciall vibe, very noce interior. Coffee is so good and staff is very very friendly and helpful. Need to go there","keywords":["special vibe","nice interior","staff is very very friendly and helpful"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Best Coffee","text":"Worth the meandering to this quiet side of Venice. It’s a small but perfect stop to enjoy a great variety of coffee!","keywords":["small but perfect stop","great variety of coffee","quiet side of Venice"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Good coffee and pastries","text":"Went here twice for coffee and pastries. Wide selection of Italian coffees. We were satisfied with them, and with the pastries. Good service, pleasant atmosphere.","keywords":["wide selection of Italian coffees","good service, pleasant atmosphere"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"When in Italy ... Coffee & Cornetto Breakfast!","text":"The macchiato is delicious and if you aren't a coffee lover, they will make you a cocoa macchiato with whipped cream. A different selection of pastries every morning to go with the coffees and equally delicious. \nThis is the easily one best coffee experience I...More","keywords":["different selection of pastries every morning","one best coffee experience"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Coffee as it should be. Worth the trip. ","text":"Walked 25min to get here with distractions and picturesque stops particularly along the bridges and waterways. \nA good experience overall from the friendly staff to the quality of the coffee and cakes.","keywords":["distractions and picturesque stops particularly along the bridges and waterways","friendly staff","quality of coffee and cakes"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Overrated ","text":"We came her based on the great reviews. We left very disappointed. The coffee is nice but I don’t feel like I have had a special coffee. \nThe cakes were so expensive that we didn’t want to part money for them. \nThe cafe is in...More","filter":true},{"coffee_shop_name":"Torrefazione Cannaregio","title":"The best coffee in Venice","text":"Wide selection of excellent coffees and some cakes. We made this our regular coffee stop in the mornings. There are 2 tables outside and a mixture of seating inside. Staff are very helpful. You pay when you leave.","keywords":["regular coffee stop","2 tables outside and a mixture of seating inside","pay when you leave"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Bad experience","text":"We came here because of the excellent reviews. However, when ordering a hot chocolate, they said they ran out of it and didn’t want to make new one (although it was only 5.30 pm). They served me the worst hot chocolate I ever had. It...More","filter":true},{"coffee_shop_name":"Torrefazione Cannaregio","title":"A must! ","text":"If you’re staying in Cannaregio you must visit this place. The coffee is wonderful and the pastries were amazing! It does get busy and locals seem to just walk to the front of the queue but it’s worth the wait. Can’t wait to go back.","keywords":["coffee is wonderful and the pastries were amazing","does get busy","locals seem to just walk to the front of the queue"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Nice coffee shop.","text":"We stopped for lunch here during a walk around the Canaregio. It's in a beautiful setting and is tastefully decorated inside. We asked the Barista to recommend a coffee for us form the myriad of bean jars behind the counter, but he seemed more interested...More","keywords":["beautiful setting","tastefully decorated inside","Barista to recommend a coffee for us"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Probably the best cafe I've had the pleasure of visiting","text":"An amazing and rare set up which allows guests to select their coffee from a range of beans and grinders set up along the bar and complimented by incredibly knowledgeable barista's to guide you in your choice. After trying a couple of flavours and receiving...More","keywords":["amazing and rare setup","guests to select their coffee from a range of beans and grinders","trying a couple of flavours and receiving"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Fabulous cafe - coffe and cakes","text":"Fab choice for coffee and cakes if you're in this area - we stayed just nearby so went for breakfast. \n\nFriendly a acommodating staff, good coffee and fab custard croissant and apple tart. \nWeren't so keen on the hot chocolate but that may be just...More","keywords":["fab custard croissant and apple tart"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Great flat white! ","text":"Best coffee I had in Venice - these guys know how to make a great flat white. Selection of cake is good, and the decor is cool. Highly recommend!","keywords":["decor is cool","great flat white"]},{"coffee_shop_name":"Torrefazione Cannaregio","title":"I do not drink coffee but I enjoyed this place","text":"My wife drinks coffee and wanted to visit this place after hearing about it. Its is a little off the main tourist area - which adds to its charm - but easily found if you just follow Google Maps directions.\nWhy did I enjoy it?...More","keywords":["little off the main tourist area"]},[{"coffee_shop_name":"Torrefazione Cannaregio","title":"Bad espresso ","text":"Had high expectations, entered the shop and ordered an espresso.\n\nIt was terrible. Little crema, way too sour, barely any flavor. Maybe it was just a bad shot on a bad day, I don't know. But I'm not willing to give it another shot.\n\nI...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Nice","text":"We did a chocolate and cake tour with Monica and she brought us here for the coffee and cake. Both were excellent. Nice place and you can also buy beans here."},{"coffee_shop_name":"Torrefazione Cannaregio","title":"A coffe before hitting the road","text":"Came from Sicily, were waiting for our transportation arangement, were a bit hungry, this place seamed like a good place.\nWe ordered 2 sandviches, the staff kindly heated them for us, and they were realy tasty.\nThe prices are rather steep, but it is realy...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Great ","text":"The coffee here is the best, the prices are reasonable and the location is great. Fast service and friendly staff. Must visit if you are a coffee lover!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Rude staff, ignores anyone who doesn’t look like a local","text":"We came to this cafe at the recommendation of Emi, who we had the pleasure of doing a rowing excursion with earlier in the day. Emi was so friendly and down to earth, sadly the staff at this cafe were the exact opposite. The barista...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Torrefazione Cannaregio","text":"We found the best place to drink coffee in Cannaregio. We discovered this coffee stop when we first noticed the huge number of people inside queued up ordering coffee. The obvious reason is the coffee is sensational, the prices reasonable and the setting on the...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Great place","text":"Super canalside, modern coffee place. Fresh coffee (from €1 upwards, a little more at a table) and pastries in the mornings(from €1.50 upwards) Decor wooden with tea/coffee chests and wooden floors. They sell coffee to take home too. Friendly young staff. Lots of Italian customers."},{"coffee_shop_name":"Torrefazione Cannaregio","title":"A True Hidden Gem!","text":"Torrefazione Cannaregio has recently moved to a new, larger, location near the Jewish Ghetto. The new location has kept some of the original fixtures such as the brass knobbed coffee bins, however, it has been given a modern twist. \n\nThe coffee is still exceptional quality....More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Perfect pick-me-up","text":"After an overnight flight from the US, while waiting to get into our Airbnb a few doors down, we decided to stop in for a coffee to try to wake up to continue our touring.  It was very hot that day- Europe was in the...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Amazing Coffee Experience ","text":"The atmosphere was lovely and the coffee is unreal! A variety of coffee beans to choose from as well"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Best Cappuccino of My Life","text":"the barista stated this would be the best cappuccino of my life and he was ABSOLUTELY CORRECT. I never wanted it to end. Take the advice of the baristas and you will not be disappointed!! A great find!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Best coffee","text":"Worth the walk to a more quiet area of Venice. The macchiato I had was delicious! Very nice place and very friendly staff! Don’t miss it!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Best coffee of our Europe trip!","text":"The coffee and service there is fantastic. You will find manny locals just standing around as they sip away at their coffee."},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Best coffee in Serenissima","text":"Very good coffee, nice baristas and perfect atmosfere. Please, stay this way, my beloved caffee! Tourists, please, respect the place."},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Superb Coffee","text":"We stopped by here for a morning espresso hit and were really impressed by the the service, decor and overall friendly vibe. Our server was really personable (we have the same Nikon d750 DSLR) and above everything else they serve really good coffee."}],[{"coffee_shop_name":"Torrefazione Cannaregio","title":"Nice mild coffee","text":"Very nice coffee. Low prices.\nVery few tables though to sit .\nOption to buy coffee beans and cut for any type of coffee machine."},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Pretty coffee shop","text":"Excellent coffee, friendly staff! Many types of coffee beans so perfect for coffee lovers, Try the cappuccino!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Great value, cozy space","text":"Delicious and decently priced coffee and superb pastry selection. Staff spoke good English, which we hadn't encountered at other establishments in the same neighborhood.  It looks to be a newer coffee shop, I hope they  continue to do well!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Nice place, excellent coffee, best Mocca ever!","text":"Perfect stop off-the-beaten track in Venice! Gentle barista and lovely calm location! Don’t hesitate to stop by!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Coffee stop","text":"Luckily we found this coffee shop on our first morning in Venice, we visited here every morning for breakfast pastry and coffee.  Wide choice of coffees, and nice pastries.  Lovely staff.   Coffee and a pastry approx 3 to 4 euros.  \n\nOne of the nicest coffee...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Didn't get served ","text":"Served locals and ignored us, seemed quite a scruffy place. Dirty table and walls. Only one person working, nit recommended."},{"coffee_shop_name":"Torrefazione Cannaregio","title":"The Best coffee I've ever drunk","text":"For sure, very gentle and helpful barista, very nice environment but the most important: the Best coffee I have ever drunk!\nTip: try the blend they make: Ghetto!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Good coffee","text":"Rustic interior, very good vibes. Best coffee I had in Venice. A variety of different roasts available, all of the drinks hand crafted. I would recommend trying the Venexian coffee (ask what it entails). \n\nReasonably prices, it’s such a same to see so much money...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Good coffee and even better atmosphere ","text":"We made a special “detour” to visit this place not only for its famous coffee but more for the atmosphere and an experience of walking through more authentic quarters of Venice: a bit shabby, not at all crowded and definitely charming) The coffeehouse overlooks a...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"THE BEST Coffee in Venice!","text":"Amazing selection of coffee and excellent service! Totally local and amazing value for Money!!! Highly recommended for all travellers! MUST visit if you are a coffee lover!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Lovely","text":"Lovely coffee. Lovely croissant. Lovely setting - many interior seating options or stand at the bar. Lovely service. This shall be my regular morning stop."},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Great Coffee","text":"Great Coffee, really nice shop. If I was being really critical I would say the lack of seating was an issue but it’s not the Italian way."},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Great Coffee Shop","text":"A great coffee shop tucked away in the side streets of Venice. The coffee we tasted on our trip was good so far, but  it was even better here. Highly recommended!"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"Best coffee of my trip!","text":"I had read about this café before going to Venice so I was eager to try it out. I only wish I had gone on my first day because I wouldn't have gone anywhere else! Not only is the coffee amazing, but incredibly cheap compared...More"},{"coffee_shop_name":"Torrefazione Cannaregio","title":"What a coffee!","text":"What a jewel for coffee lovers!\nCoffee in Italy is excellent everywhere (so hard to get back home after became addicted), but this establishment took it to another level.\nIndulge yourself with a variety of cups from different types, just be prepared to stay awake...More"}],[{"coffee_shop_name":"Caffe Del Doge","title":"Nice mild coffee","text":"Very nice coffee. Low prices.\nVery few tables though to sit .\nOption to buy coffee beans and cut for any type of coffee machine."},{"coffee_shop_name":"Caffe Del Doge","title":"Pretty coffee shop","text":"Excellent coffee, friendly staff! Many types of coffee beans so perfect for coffee lovers, Try the cappuccino!"},{"coffee_shop_name":"Caffe Del Doge","title":"Great value, cozy space","text":"Delicious and decently priced coffee and superb pastry selection. Staff spoke good English, which we hadn't encountered at other establishments in the same neighborhood.  It looks to be a newer coffee shop, I hope they  continue to do well!"},{"coffee_shop_name":"Caffe Del Doge","title":"Nice place, excellent coffee, best Mocca ever!","text":"Perfect stop off-the-beaten track in Venice! Gentle barista and lovely calm location! Don’t hesitate to stop by!"},{"coffee_shop_name":"Caffe Del Doge","title":"Coffee stop","text":"Luckily we found this coffee shop on our first morning in Venice, we visited here every morning for breakfast pastry and coffee.  Wide choice of coffees, and nice pastries.  Lovely staff.   Coffee and a pastry approx 3 to 4 euros.  \n\nOne of the nicest coffee...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Didn't get served ","text":"Served locals and ignored us, seemed quite a scruffy place. Dirty table and walls. Only one person working, nit recommended."},{"coffee_shop_name":"Caffe Del Doge","title":"The Best coffee I've ever drunk","text":"For sure, very gentle and helpful barista, very nice environment but the most important: the Best coffee I have ever drunk!\nTip: try the blend they make: Ghetto!"},{"coffee_shop_name":"Caffe Del Doge","title":"Good coffee","text":"Rustic interior, very good vibes. Best coffee I had in Venice. A variety of different roasts available, all of the drinks hand crafted. I would recommend trying the Venexian coffee (ask what it entails). \n\nReasonably prices, it’s such a same to see so much money...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Good coffee and even better atmosphere ","text":"We made a special “detour” to visit this place not only for its famous coffee but more for the atmosphere and an experience of walking through more authentic quarters of Venice: a bit shabby, not at all crowded and definitely charming) The coffeehouse overlooks a...More"},{"coffee_shop_name":"Caffe Del Doge","title":"THE BEST Coffee in Venice!","text":"Amazing selection of coffee and excellent service! Totally local and amazing value for Money!!! Highly recommended for all travellers! MUST visit if you are a coffee lover!"},{"coffee_shop_name":"Caffe Del Doge","title":"Lovely","text":"Lovely coffee. Lovely croissant. Lovely setting - many interior seating options or stand at the bar. Lovely service. This shall be my regular morning stop."},{"coffee_shop_name":"Caffe Del Doge","title":"Great Coffee","text":"Great Coffee, really nice shop. If I was being really critical I would say the lack of seating was an issue but it’s not the Italian way."},{"coffee_shop_name":"Caffe Del Doge","title":"Great Coffee Shop","text":"A great coffee shop tucked away in the side streets of Venice. The coffee we tasted on our trip was good so far, but  it was even better here. Highly recommended!"},{"coffee_shop_name":"Caffe Del Doge","title":"Best coffee of my trip!","text":"I had read about this café before going to Venice so I was eager to try it out. I only wish I had gone on my first day because I wouldn't have gone anywhere else! Not only is the coffee amazing, but incredibly cheap compared...More"},{"coffee_shop_name":"Caffe Del Doge","title":"What a coffee!","text":"What a jewel for coffee lovers!\nCoffee in Italy is excellent everywhere (so hard to get back home after became addicted), but this establishment took it to another level.\nIndulge yourself with a variety of cups from different types, just be prepared to stay awake...More"}],[{"coffee_shop_name":"Caffe Del Doge","title":"Great coffee, but...","text":"Great coffee, I saw locals like this place too, there is a gentle waiter, prices are moderatly high, but brioches are not fresh at all."},{"coffee_shop_name":"Caffe Del Doge","title":"Very nice atmosphere ","text":"I went in this morning for a coffee. Lovely workers. Lovely croissants. The coffee was a little weak for my liking however delicious all the same"},{"coffee_shop_name":"Caffe Del Doge","title":"Excellent coffee and friendly staff.","text":"A late afternoon stop for a coffee during rainstorm was a very pleasant experience. Super good coffee - lots of choice including single type coffees (not just blends) and some dolce's.  Staff was professional and friendly. Recommended."},{"coffee_shop_name":"Caffe Del Doge","title":"Tasty food","text":"Passed by here and the food in the counter spoke to me. The place looks contemporary and cozy. All the food on display looked tasty and the service was good, I had chicken and potatoes which was delicious. Worth a visit."},{"coffee_shop_name":"Caffe Del Doge","title":"Good options of coffee and tea","text":"Nice place if you’re looking to have a coffee or tea. \n- tables outside or inside\n- sell snacks also\n- coffees from other countries \n- affogato is ok\n- expensive as almost everything in Venezia"},{"coffee_shop_name":"Caffe Del Doge","title":"Coffe Time","text":"If you need any place to rest and drink something good I recommend this one.\nWe loved this delicious cappuccino as you see the pic!\nNice enviroment and good service!\n\nNice enviroment, good service!"},{"coffee_shop_name":"Caffe Del Doge","title":"hidden gem near St. Mark's Square.","text":"Excellent service, hidden gem near St Mark's Square. Very reasonable price considering the location. It was boiling hot outside when by accident found it, we really enjoyed the cold coffee. Graze Cafe del Doge! 🇮🇹"},{"coffee_shop_name":"Caffe Del Doge","title":"Hidden Gem","text":"Found Caffe del Doge by accident on our last day in Venezia after watching The Befanas rowing up the Grand canale.We wanted a hot drink it was so cold &  down a calle past Rialto Bridge . It was very busy & I think at...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Perfect coffee break ","text":"Perfect for a break from the crowds and heat. Beautiful coffee and delicious little pastries. Very friendly staff and nice airy space to sit in. All menus in English so no guesswork. Will visit when we come back."},{"coffee_shop_name":"Caffe Del Doge","title":"Not that special ","text":"My son and I went for breakfast there. Service was fast and professional, even friendly.\nCoffee was a bit on the weak side, the hot chocolate was basically liquid chocolate, way too rich. Pastry just like anywhere else.\nThis place is ok but nothing special....More"},{"coffee_shop_name":"Caffe Del Doge","title":"Rude staff","text":"Just stopped for a coffee before I take the alilaguna to go at the airport.I ordered a cappuccino and I preferred to stay in.I was waiting for almost 20 minutes and when I asked them, they seem to forgot my order(the shop was not even...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Coffee Heaven","text":"vi prego di indicare l'esatta ubicazione del locale dove siete stati perché e' importante grazie giuliano"},{"coffee_shop_name":"Caffe Del Doge","title":"Rude to Americans","text":"Lovely little bistro bar. We had coffee here on a few mornings, but they also serve food and drink. Very quaint and the coffee is excellente."},{"coffee_shop_name":"Caffe Del Doge","title":"Great place and very friendly","text":"Rude barista was very impatient because I was having difficulty reading the menu behind the counter, high on the wall without my glasses, when I was the only customer. She got aggravated because I didn’t understand Italian even though I was standing there with Euros...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Great coffee","text":"Brilliant friendly little cafe tucked away down one of the lanes off the grand canal. Staff were so friendly, served quickly and the place has a lively atmosphere. Nice clean toilet as well!"}],[{"coffee_shop_name":"Caffe Del Doge","title":"The best coffee in Venice, extra nice staff, hidden but marvelous!!!!!","text":"I was there yeasterday, it is the best coffee that I have in a long time!!! I had espresso and my daughter had the cappuccino. We paid ridiculously small price :) and get so much smiles from lovely staff and help finding some church on...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Good Coffee and juices","text":"A good place to have coffee with snacks. Good service and felt welcomed even though I'm Asian  unlike some cafe's in Venice."},{"coffee_shop_name":"Caffe Del Doge","title":"Hidden gem for coffee lovers","text":"Small but busy coffee house where they roast their own beans. On a small back street but not to difficult to find.\nTry the Giacometto, Venetian celebrity chef Enrica Rocco recommends this coffee drink blended with hazelnut, chocolate and toasted almonds. It's too die for!...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Best Caffe in Venice","text":"This is simply the best most consistent coffee in Venice. Also an added perk, no extra charge to sit (most places have two prices; one for coffee at counter and one for coffee at table)"},{"coffee_shop_name":"Caffe Del Doge","title":"Nice cafe, really good coffee, charming young waiter less charming older waiter","text":"We had a good stop here for coffee and a brief sit down the young man who served us was charming, easy going and tried hard to understand our woeful italian, his older companion was less so and we were pleased we got the younger...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Nice but nothing special","text":"We went there to have some hot chocolates and some pieces of cake. The hot chocolate was good (much thicker than what you get in Germany or Austria/less liquid), atmosphere was ok, selection of cakes/pastries was ok, staff was ok, .... In total: Nice but...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Fab lkace","text":"Absolutely loved this place. Great atmosphere and staff lovely. Food was very nice and F&Drinks well priced. Went back a second time during our stay. Thanks for a couple of great nights. Would definitely recommend. Stuart and Lucy."},{"coffee_shop_name":"Caffe Del Doge","title":"Great cafe ","text":"The coffee here is excellent as are the fresh juices. This place is worth finding if your a coffee lover."},{"coffee_shop_name":"Caffe Del Doge","title":"Terrible panini with prosciuto crudo.","text":"Went with my wife and 2 year old to have a panini and a capucinno but ended up feeling sorry we chose to enter and order. We asked for a panini caldo but it was just two slices of thick bread with a thin, cold...More"},{"coffee_shop_name":"Caffe Del Doge","title":"great coffee","text":"buon giorno ma e' sicuro di essere andato al caffe del doge a san polo 609 dove lavorano solo ragazze...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Crowdy","text":"beautiful coffee shop,nice cakes good coffee,full of locals which is always a good sign,very reasonable prices as well"},{"coffee_shop_name":"Caffe Del Doge","title":"Breakfast","text":"It is a really crowdy place! You can't sit down!  We ate a canoli there, it was tasty but expensive! The employees was nincs and helpful!"},{"coffee_shop_name":"Caffe Del Doge","title":"One of the best coffees in Venice","text":"We visited this cafe based on the trip advisor reviews... we were not disappointed ! We were the only tourists in there but heaving with Italians... great pastries and coffee and reasonably priced for Venice!"},{"coffee_shop_name":"Caffe Del Doge","title":"Anniversary Visit 2018...","text":"This coffee house is great. You get the biggest cappuccino, one of the best in Venice. Again you know because locals and tourists end up there specially in the morning. You can also buy the coffee and related products wich is good."},{"coffee_shop_name":"Caffe Del Doge","title":"Amazing Espresso and Tiramisu ","text":"A memorable visit here with great customer service. Will 100% recommend. We had a fantastic time and the atmosphere was very peaceful."}],[{"coffee_shop_name":"Caffe Del Doge","title":"Best coffee hands-down in Venice ","text":"Not just the standard espressos but the creative mixtures are awesome. Espresso with hot milk (lactose-frees are catered with soya milk) , cacao etc. \nLittle off the beaten track but worth the find for those who are coffee connoisseurs"},{"coffee_shop_name":"Caffe Del Doge","title":"Best hot chocolate ever ","text":"Myself and my wife just visited the cafe today. Very busy but got a table straight away. Got a latte and hot chocolate and a couple of muffins. Hot chocolate was the thickest and tastiest I have ever had, was like a bar of melted...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Best cafe in Venice","text":"Not easy to find, in an obscure alley, but well worth the effort.\n\nAmazing varieties of coffee, both single source and blends. \n\nV friendly and knowledgeable staff.\n\nPerfect start to a day in Venice!"},{"coffee_shop_name":"Caffe Del Doge","title":"Best coffee in venice","text":"Locals only -best coffee in Venice. Serves every combination of coffee you could want all day long. On small side street near Rialto bridge. Go find it!"},{"coffee_shop_name":"Caffe Del Doge","title":"Great Coffee and Snacks","text":"We enjoyed the coffee at this cafe so much we bought some of the coffee to take home. The food was also good. The cafe was down a side-street and did not feel to touristy."},{"coffee_shop_name":"Caffe Del Doge","title":"Great Coffee","text":"So we have had a few coffee's since arriving in Italy a week ago, but Caffe Del Doge was by far and away the best without a doubt!"},{"coffee_shop_name":"Caffe Del Doge","title":"OMG!!","text":"Possibly the best hot chocolate in the known universe!  Rich and dark and full of goodness - and delightful staff as well!!"},{"coffee_shop_name":"Caffe Del Doge","title":"Still the best","text":"I used to live in Italy and since returning stateside I have desperately missed the coffee. Caffè del Doge is one of my very favorite coffee bars in the country (the other is in Rome). The staff at the caffè is very friendly and welcoming....More"},{"coffee_shop_name":"Caffe Del Doge","title":"Still brill!","text":"Very surprised a customer was disappointed. Just returned after a year. Same quality drinks and food. Still busy and still worth searching for."},{"coffee_shop_name":"Caffe Del Doge","title":"Overrated !","text":"The croissants were ok and the cappuccino was good but the prices are a little expensive. Nothing of special how the reviews say!"},{"coffee_shop_name":"Caffe Del Doge","title":"Worth the search","text":"We are from Seattle. We love coffee. My husband and I had the espresso shot in gelato. Exquisite! It was definitely worth the effort to track it down."},{"coffee_shop_name":"Caffe Del Doge","title":"Top coffee place in Venice","text":"This place is tucked away in a side road in Venice just off the grand canal. A variety of coffee beans from all over the globe and a great choice of sandwiches and cakes."},{"coffee_shop_name":"Caffe Del Doge","title":"Hard to find but worth the search ","text":"We found this place because it had good reviews and was within walking distance from our hostel. We sat down to enjoy our coffee and pastries. I had the cappuccino Venetio and a croissant crema and both were amazing and very fairly priced. If you're...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Superb coffee! A must for coffee lovers.","text":"I had a nero blend expresso at the bar and it was absolutely fantastic. This is truly a gem of a coffee shop, hidden in a narrow walkway of Venice. Coffee lovers should definitely visit."},{"coffee_shop_name":"Caffe Del Doge","title":"Refuge and friendliness ","text":"Hidden down a side alley, and, despite a mention in at least one guide book, not over run. Helpful and welcoming staff, and coffee that is made with some style - this was the only cafe we went to where some skill at latte art...More"}],[{"coffee_shop_name":"Caffe Del Doge","title":"Best coffee hands-down in Venice ","text":"Not just the standard espressos but the creative mixtures are awesome. Espresso with hot milk (lactose-frees are catered with soya milk) , cacao etc. \nLittle off the beaten track but worth the find for those who are coffee connoisseurs"},{"coffee_shop_name":"Caffe Del Doge","title":"Best hot chocolate ever ","text":"Myself and my wife just visited the cafe today. Very busy but got a table straight away. Got a latte and hot chocolate and a couple of muffins. Hot chocolate was the thickest and tastiest I have ever had, was like a bar of melted...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Best cafe in Venice","text":"Not easy to find, in an obscure alley, but well worth the effort.\n\nAmazing varieties of coffee, both single source and blends. \n\nV friendly and knowledgeable staff.\n\nPerfect start to a day in Venice!"},{"coffee_shop_name":"Caffe Del Doge","title":"Best coffee in venice","text":"Locals only -best coffee in Venice. Serves every combination of coffee you could want all day long. On small side street near Rialto bridge. Go find it!"},{"coffee_shop_name":"Caffe Del Doge","title":"Great Coffee and Snacks","text":"We enjoyed the coffee at this cafe so much we bought some of the coffee to take home. The food was also good. The cafe was down a side-street and did not feel to touristy."},{"coffee_shop_name":"Caffe Del Doge","title":"Great Coffee","text":"So we have had a few coffee's since arriving in Italy a week ago, but Caffe Del Doge was by far and away the best without a doubt!"},{"coffee_shop_name":"Caffe Del Doge","title":"OMG!!","text":"Possibly the best hot chocolate in the known universe!  Rich and dark and full of goodness - and delightful staff as well!!"},{"coffee_shop_name":"Caffe Del Doge","title":"Still the best","text":"I used to live in Italy and since returning stateside I have desperately missed the coffee. Caffè del Doge is one of my very favorite coffee bars in the country (the other is in Rome). The staff at the caffè is very friendly and welcoming....More"},{"coffee_shop_name":"Caffe Del Doge","title":"Still brill!","text":"Very surprised a customer was disappointed. Just returned after a year. Same quality drinks and food. Still busy and still worth searching for."},{"coffee_shop_name":"Caffe Del Doge","title":"Overrated !","text":"The croissants were ok and the cappuccino was good but the prices are a little expensive. Nothing of special how the reviews say!"},{"coffee_shop_name":"Caffe Del Doge","title":"Worth the search","text":"We are from Seattle. We love coffee. My husband and I had the espresso shot in gelato. Exquisite! It was definitely worth the effort to track it down."},{"coffee_shop_name":"Caffe Del Doge","title":"Top coffee place in Venice","text":"This place is tucked away in a side road in Venice just off the grand canal. A variety of coffee beans from all over the globe and a great choice of sandwiches and cakes."},{"coffee_shop_name":"Caffe Del Doge","title":"Hard to find but worth the search ","text":"We found this place because it had good reviews and was within walking distance from our hostel. We sat down to enjoy our coffee and pastries. I had the cappuccino Venetio and a croissant crema and both were amazing and very fairly priced. If you're...More"},{"coffee_shop_name":"Caffe Del Doge","title":"Superb coffee! A must for coffee lovers.","text":"I had a nero blend expresso at the bar and it was absolutely fantastic. This is truly a gem of a coffee shop, hidden in a narrow walkway of Venice. Coffee lovers should definitely visit."},{"coffee_shop_name":"Caffe Del Doge","title":"Refuge and friendliness ","text":"Hidden down a side alley, and, despite a mention in at least one guide book, not over run. Helpful and welcoming staff, and coffee that is made with some style - this was the only cafe we went to where some skill at latte art...More"}]]